imagou/QiitaSource/toppers/stm32l4xx/asp/arch/arm_m_gcc/stm32l4xx/_renamed_stm32l4xx.h
/*
 *  FIREWALL
 */
#define TADR_FIREWALL_BASE  (APB2PERIPH_BASE + 0x1C00)
#define TOFF_FW_CSSA        0x0000		/* (RW) Code Segment Start Address register */
  #define FW_CSSA_ADD        0x00FFFF00	/* Code Segment Start Address */
#define TOFF_FW_CSL         0x0004		/* (RW) Code Segment Length register */
  #define FW_CSL_LENG        0x003FFF00	/* Code Segment Length */
#define TOFF_FW_NVDSSA      0x0008		/* (RW) NON volatile data Segment Start Address register */
  #define FW_NVDSSA_ADD      0x00FFFF00	/* Non Volatile Dat Segment Start Address */ 
#define TOFF_FW_NVDSL       0x000C		/* (RW) NON volatile data Segment Length register */
  #define FW_NVDSL_LENG      0x003FFF00	/* Non Volatile Data Segment Length */
#define TOFF_FW_VDSSA       0x0010		/* (RW) Volatile data Segment Start Address register */
  #define FW_VDSSA_ADD       0x0000FFC0	/* Volatile Data Segment Start Address */ 
#define TOFF_FW_VDSL        0x0014		/* (RW) Volatile data Segment Length register */
  #define FW_VDSL_LENG       0x0000FFC0	/* Volatile Data Segment Length */ 
#define TOFF_FW_CR          0x0020		/* (RW) Configuration  register */
  #define FW_CR_FPA          0x00000001	/* Firewall Pre Arm*/
  #define FW_CR_VDS          0x00000002	/* Volatile Data Sharing*/
  #define FW_CR_VDE          0x00000004	/* Volatile Data Execution*/


/*
 *  SD HOST INTERFACE
 */
#if !defined(TOPPERS_STM32L476_DISCOVERY) && !defined(TOPPERS_STM32L476_NUCLEO64)
#define TADR_SDMMC1_BASE    (APB2PERIPH_BASE + 0x08062400)
#else
#define TADR_SDMMC1_BASE    (APB2PERIPH_BASE + 0x2800)
#endif
#define TOFF_SDIO_POWER     0x0000		/* (RW) SDIO power control register */
  #define SDMMC_POWER_PWRCTRL   0x00000003	/* PWRCTRL[1:0] bits (Power supply control bits) */
  #define SDMMC_POWER_PWRCTRL_0 0x00000001	/* Bit 0 */
  #define SDMMC_POWER_PWRCTRL_1 0x00000002	/* Bit 1 */
#define TOFF_SDIO_CLKCR     0x0004		/* (RW) SDI clock control register */
  #define SDMMC_CLKCR_CLKDIV    0x000000FF	/* Clock divide factor             */
  #define SDMMC_CLKCR_CLKEN     0x00000100	/* Clock enable bit                */
  #define SDMMC_CLKCR_PWRSAV    0x00000200	/* Power saving configuration bit  */
  #define SDMMC_CLKCR_BYPASS    0x00000400	/* Clock divider bypass enable bit */
  #define SDMMC_CLKCR_WIDBUS    0x00001800	/* WIDBUS[1:0] bits (Wide bus mode enable bit) */
  #define SDMMC_CLKCR_WIDBUS_0  0x00000800	/* Bit 0 */
  #define SDMMC_CLKCR_WIDBUS_1  0x00001000	/* Bit 1 */
  #define SDMMC_CLKCR_NEGEDGE   0x00002000	/* SDMMC_CK dephasing selection bit */
  #define SDMMC_CLKCR_HWFC_EN   0x00004000	/* HW Flow Control enable          */
#define TOFF_SDIO_ARG       0x0008		/* (RW) SDIO argument register */
#define TOFF_SDIO_CMD       0x000C		/* (RW) SDIO command register */
  #define SDMMC_CMD_CMDINDEX    0x0000003F	/* Command Index                               */
  #define SDMMC_CMD_WAITRESP    0x000000C0	/* WAITRESP[1:0] bits (Wait for response bits) */
  #define SDMMC_CMD_WAITRESP_0  0x00000040	/* Bit 0 */
  #define SDMMC_CMD_WAITRESP_1  0x00000080	/* Bit 1 */
  #define SDMMC_CMD_WAITINT     0x00000100	/* CPSM Waits for Interrupt Request */
  #define SDMMC_CMD_WAITPEND    0x00000200	/* CPSM Waits for ends of data transfer (CmdPend internal signal) */
  #define SDMMC_CMD_CPSMEN      0x00000400	/* Command path state machine (CPSM) Enable bit */
  #define SDMMC_CMD_SDIOSUSPEND 0x00000800	/* SD I/O suspend command */
#define TOFF_SDIO_RESPCMD   0x0010		/* (R)  SDIO command response register */
#define TOFF_SDIO_RESP      0x0014		/* (R)  SDIO response 1 register */
#define TOFF_SDIO_RESP2     0x0018		/* (R)  SDIO response 2 register */
#define TOFF_SDIO_RESP3     0x001C		/* (R)  SDIO response 3 register */
#define TOFF_SDIO_RESP4     0x0020		/* (R)  SDIO response 4 register */
#define TOFF_SDIO_DTIMER    0x0024		/* (RW) SDIO data timer register */
#define TOFF_SDIO_DLEN      0x0028		/* (RW) SDIO data length register */
#define TOFF_SDIO_DCTRL     0x002C		/* (RW) SDIO data control register */
  #define SDMMC_DCTRL_DTEN      0x00000001	/* Data transfer enabled bit */
  #define SDMMC_DCTRL_DTDIR     0x00000002	/* Data transfer direction selection */
  #define SDMMC_DCTRL_DTMODE    0x00000004	/* Data transfer mode selection      */
  #define SDMMC_DCTRL_DMAEN     0x00000008	/* DMA enabled bit                   */
  #define SDMMC_DCTRL_DBLOCKSIZE    0x00F0	/* DBLOCKSIZE[3:0] bits (Data block size) */
  #define SDMMC_DCTRL_DBLOCKSIZE_0  0x0010	/* Bit 0 */
  #define SDMMC_DCTRL_DBLOCKSIZE_1  0x0020	/* Bit 1 */
  #define SDMMC_DCTRL_DBLOCKSIZE_2  0x0040	/* Bit 2 */
  #define SDMMC_DCTRL_DBLOCKSIZE_3  0x0080	/* Bit 3 */
  #define SDMMC_DCTRL_RWSTART   0x00000100	/* Read wait start */
  #define SDMMC_DCTRL_RWSTOP    0x00000200	/* Read wait stop */
  #define SDMMC_DCTRL_RWMOD     0x00000400	/* Read wait mode */
  #define SDMMC_DCTRL_SDIOEN    0x00000800	/* SD I/O enable functions */
#define TOFF_SDIO_DCOUNT    0x0030		/* (R)  SDIO data counter register */
#define TOFF_SDIO_STA       0x0034		/* (R)  SDIO status register */
  #define SDMMC_STA_CCRCFAIL    0x00000001	/* Command response received (CRC check failed)  */
  #define SDMMC_STA_DCRCFAIL    0x00000002	/* Data block sent/received (CRC check failed)   */
  #define SDMMC_STA_CTIMEOUT    0x00000004	/* Command response timeout                      */
  #define SDMMC_STA_DTIMEOUT    0x00000008	/* Data timeout                                  */
  #define SDMMC_STA_TXUNDERR    0x00000010	/* Transmit FIFO underrun error                  */
  #define SDMMC_STA_RXOVERR     0x00000020	/* Received FIFO overrun error                   */
  #define SDMMC_STA_CMDREND     0x00000040	/* Command response received (CRC check passed)  */
  #define SDMMC_STA_CMDSENT     0x00000080	/* Command sent (no response required)           */
  #define SDMMC_STA_DATAEND     0x00000100	/* Data end (data counter, SDIDCOUNT, is zero)   */
  #define SDMMC_STA_STBITERR    0x00000200	/* Start bit not detected on all data signals in wide bus mode */
  #define SDMMC_STA_DBCKEND     0x00000400	/* Data block sent/received (CRC check passed)   */
  #define SDMMC_STA_CMDACT      0x00000800	/* Command transfer in progress                  */
  #define SDMMC_STA_TXACT       0x00001000	/* Data transmit in progress                     */
  #define SDMMC_STA_RXACT       0x00002000	/* Data receive in progress                      */
  #define SDMMC_STA_TXFIFOHE    0x00004000	/* Transmit FIFO Half Empty: at least 8 words can be written into the FIFO */
  #define SDMMC_STA_RXFIFOHF    0x00008000	/* Receive FIFO Half Full: there are at least 8 words in the FIFO */
  #define SDMMC_STA_TXFIFOF     0x00010000	/* Transmit FIFO full */
  #define SDMMC_STA_RXFIFOF     0x00020000	/* Receive FIFO full */
  #define SDMMC_STA_TXFIFOE     0x00040000	/* Transmit FIFO empty */
  #define SDMMC_STA_RXFIFOE     0x00080000	/* Receive FIFO empty */
  #define SDMMC_STA_TXDAVL      0x00100000	/* Data available in transmit FIFO */
  #define SDMMC_STA_RXDAVL      0x00200000	/* Data available in receive FIFO */
  #define SDMMC_STA_SDIOIT      0x00400000	/* SDMMC interrupt received */
#define TOFF_SDIO_ICR       0x0038		/* (RW) SDIO interrupt clear register */
  #define SDMMC_ICR_CCRCFAILC   0x00000001	/* CCRCFAIL flag clear bit */
  #define SDMMC_ICR_DCRCFAILC   0x00000002	/* DCRCFAIL flag clear bit */
  #define SDMMC_ICR_CTIMEOUTC   0x00000004	/* CTIMEOUT flag clear bit */
  #define SDMMC_ICR_DTIMEOUTC   0x00000008	/* DTIMEOUT flag clear bit */
  #define SDMMC_ICR_TXUNDERRC   0x00000010	/* TXUNDERR flag clear bit */
  #define SDMMC_ICR_RXOVERRC    0x00000020	/* RXOVERR flag clear bit  */
  #define SDMMC_ICR_CMDRENDC    0x00000040	/* CMDREND flag clear bit  */
  #define SDMMC_ICR_CMDSENTC    0x00000080	/* CMDSENT flag clear bit  */
  #define SDMMC_ICR_DATAENDC    0x00000100	/* DATAEND flag clear bit  */
  #define SDMMC_ICR_STBITERRC   0x00000200	/* STBITERR flag clear bit */
  #define SDMMC_ICR_DBCKENDC    0x00000400	/* DBCKEND flag clear bit  */
  #define SDMMC_ICR_SDIOITC     0x00400000	/* SDMMCIT flag clear bit   */
#define TOFF_SDIO_MASK      0x003C		/* (RW) SDIO mask register */
  #define SDMMC_MASK_CCRCFAILIE 0x00000001	/* Command CRC Fail Interrupt Enable */
  #define SDMMC_MASK_DCRCFAILIE 0x00000002	/* Data CRC Fail Interrupt Enable */
  #define SDMMC_MASK_CTIMEOUTIE 0x00000004	/* Command TimeOut Interrupt Enable */
  #define SDMMC_MASK_DTIMEOUTIE 0x00000008	/* Data TimeOut Interrupt Enable */
  #define SDMMC_MASK_TXUNDERRIE 0x00000010	/* Tx FIFO UnderRun Error Interrupt Enable */
  #define SDMMC_MASK_RXOVERRIE  0x00000020	/* Rx FIFO OverRun Error Interrupt Enable */
  #define SDMMC_MASK_CMDRENDIE  0x00000040	/* Command Response Received Interrupt Enable */
  #define SDMMC_MASK_CMDSENTIE  0x00000080	/* Command Sent Interrupt Enable */
  #define SDMMC_MASK_DATAENDIE  0x00000100	/* Data End Interrupt Enable */
  #define SDMMC_MASK_DBCKENDIE  0x00000400	/* Data Block End Interrupt Enable */
  #define SDMMC_MASK_CMDACTIE   0x00000800	/* CCommand Acting Interrupt Enable */
  #define SDMMC_MASK_TXACTIE    0x00001000	/* Data Transmit Acting Interrupt Enable */
  #define SDMMC_MASK_RXACTIE    0x00002000	/* Data receive acting interrupt enabled */
  #define SDMMC_MASK_TXFIFOHEIE 0x00004000	/* Tx FIFO Half Empty interrupt Enable */
  #define SDMMC_MASK_RXFIFOHFIE 0x00008000	/* Rx FIFO Half Full interrupt Enable */
  #define SDMMC_MASK_TXFIFOFIE  0x00010000	/* Tx FIFO Full interrupt Enable */
  #define SDMMC_MASK_RXFIFOFIE  0x00020000	/* Rx FIFO Full interrupt Enable */
  #define SDMMC_MASK_TXFIFOEIE  0x00040000	/* Tx FIFO Empty interrupt Enable */
  #define SDMMC_MASK_RXFIFOEIE  0x00080000	/* Rx FIFO Empty interrupt Enable */
  #define SDMMC_MASK_TXDAVLIE   0x00100000	/* Data available in Tx FIFO interrupt Enable */
  #define SDMMC_MASK_RXDAVLIE   0x00200000	/* Data available in Rx FIFO interrupt Enable */
  #define SDMMC_MASK_SDIOITIE   0x00400000	/* SDMMC Mode Interrupt Received interrupt Enable */
#define TOFF_SDIO_FIFOCNT   0x0048		/* (R)  SDIO FIFO counter register */
#define TOFF_SDIO_FIFO      0x0080		/* (RW) SDIO data FIFO register */


