imagou/QiitaSource/toppers/stm32l4xx/asp/arch/arm_m_gcc/stm32l4xx/_renamed_stm32l4xx.h
/*
 *  DMA2D CONTROLLER
 */
#define TADR_DMA2D_BASE     (AHB1PERIPH_BASE + 0xB000)
#define TOFF_DMA2D_CR       0x0000		/* (RW) DMA2D Control Register */
  #define DMA2D_CR_START     0x00000001	/* Start transfer */
  #define DMA2D_CR_SUSP      0x00000002	/* Suspend transfer */
  #define DMA2D_CR_ABORT     0x00000004	/* Abort transfer */
  #define DMA2D_CR_LOM       0x00000040	/* Line Offset Mode */
  #define DMA2D_CR_TEIE      0x00000100	/* Transfer Error Interrupt Enable */
  #define DMA2D_CR_TCIE      0x00000200	/* Transfer Complete Interrupt Enable */
  #define DMA2D_CR_TWIE      0x00000400	/* Transfer Watermark Interrupt Enable */
  #define DMA2D_CR_CAEIE     0x00000800	/* CLUT Access Error Interrupt Enable */
  #define DMA2D_CR_CTCIE     0x00001000	/* CLUT Transfer Complete Interrupt Enable */
  #define DMA2D_CR_CEIE      0x00002000	/* Configuration Error Interrupt Enable */
  #define DMA2D_CR_MODE      0x00070000	/* DMA2D Mode[2:0] */
  #define DMA2D_CR_MODE_0    0x00010000
  #define DMA2D_CR_MODE_1    0x00020000
  #define DMA2D_CR_MODE_2    0x00040000
#define TOFF_DMA2D_ISR      0x0004		/* (RW) DMA2D Interrupt Status Register */
  #define DMA2D_ISR_TEIF     0x00000001	/* Transfer Error Interrupt Flag */
  #define DMA2D_ISR_TCIF     0x00000002	/* Transfer Complete Interrupt Flag */
  #define DMA2D_ISR_TWIF     0x00000004	/* Transfer Watermark Interrupt Flag */
  #define DMA2D_ISR_CAEIF    0x00000008	/* CLUT Access Error Interrupt Flag */
  #define DMA2D_ISR_CTCIF    0x00000010	/* CLUT Transfer Complete Interrupt Flag */
  #define DMA2D_ISR_CEIF     0x00000020	/* Configuration Error Interrupt Flag */
#define TOFF_DMA2D_IFCR     0x0008		/* (RW) DMA2D Interrupt Flag Clear Register */
  #define DMA2D_IFCR_CTEIF   0x00000001	/* Clears Transfer Error Interrupt Flag */
  #define DMA2D_IFCR_CTCIF   0x00000002	/* Clears Transfer Complete Interrupt Flag */
  #define DMA2D_IFCR_CTWIF   0x00000004	/* Clears Transfer Watermark Interrupt Flag */
  #define DMA2D_IFCR_CAECIF  0x00000008	/* Clears CLUT Access Error Interrupt Flag */
  #define DMA2D_IFCR_CCTCIF  0x00000010	/* Clears CLUT Transfer Complete Interrupt Flag */
  #define DMA2D_IFCR_CCEIF   0x00000020	/* Clears Configuration Error Interrupt Flag */
#define TOFF_DMA2D_FGMAR    0x000C		/* (RW) DMA2D Foreground Memory Address Register */
#define TOFF_DMA2D_FGOR     0x0010		/* (RW) DMA2D Foreground Offset Register */
#define TOFF_DMA2D_BGMAR    0x0014		/* (RW) DMA2D Background Memory Address Register*/
#define TOFF_DMA2D_BGOR     0x0018		/* (RW) DMA2D Background Offset Register */
#define TOFF_DMA2D_FGPFCCR  0x001C		/* (RW) DMA2D Foreground PFC Control Register */
  #define DMA2D_FGPFCCR_CM   0x0000000F	/* Input color mode CM[3:0] */
  #define DMA2D_FGPFCCR_CM_0 0x00000001
  #define DMA2D_FGPFCCR_CM_1 0x00000002
  #define DMA2D_FGPFCCR_CM_2 0x00000004
  #define DMA2D_FGPFCCR_CM_3 0x00000008
  #define DMA2D_FGPFCCR_CCM  0x00000010	/* CLUT Color mode */
  #define DMA2D_FGPFCCR_START  0x00000020	/* Start */
  #define DMA2D_FGPFCCR_CS   0x0000FF00	/* CLUT size */
  #define DMA2D_FGPFCCR_AM   0x00030000	/* Alpha mode AM[1:0] */
  #define DMA2D_FGPFCCR_AM_0 0x00010000
  #define DMA2D_FGPFCCR_AM_1 0x00020000
  #define DMA2D_FGPFCCR_AI   0x00100000	/* Alpha Inverted */
  #define DMA2D_FGPFCCR_RBS  0x00200000	/* Red Blue Swap */
  #define DMA2D_FGPFCCR_ALPHA  0xFF000000	/* Alpha value */
#define TOFF_DMA2D_FGCOLR   0x0020		/* (RW) DMA2D Foreground Color Register */
  #define DMA2D_FGCOLR_BLUE  0x000000FF	/* Blue Value */
  #define DMA2D_FGCOLR_GREEN 0x0000FF00	/* Green Value */
  #define DMA2D_FGCOLR_RED   0x00FF0000	/* Red Value */
#define TOFF_DMA2D_BGPFCCR  0x0024		/* (RW) DMA2D Background PFC Control Register */
  #define DMA2D_BGPFCCR_CM   0x0000000F	/* Input color mode CM[3:0] */
  #define DMA2D_BGPFCCR_CM_0 0x00000001
  #define DMA2D_BGPFCCR_CM_1 0x00000002
  #define DMA2D_BGPFCCR_CM_2 0x00000004
  #define DMA2D_BGPFCCR_CM_3 0x00000008
  #define DMA2D_BGPFCCR_CCM  0x00000010	/* CLUT Color mode */
  #define DMA2D_BGPFCCR_START  0x00000020	/* Start */
  #define DMA2D_BGPFCCR_CS   0x0000FF00	/* CLUT size */
  #define DMA2D_BGPFCCR_AM   0x00030000	/* Alpha mode AM[1:0] */
  #define DMA2D_BGPFCCR_AM_0 0x00010000
  #define DMA2D_BGPFCCR_AM_1 0x00020000
  #define DMA2D_BGPFCCR_AI   0x00100000	/* Alpha Inverted */
  #define DMA2D_BGPFCCR_RBS  0x00200000	/* Red Blue Swap */
  #define DMA2D_BGPFCCR_ALPHA  0xFF000000	/* Alpha value */
#define TOFF_DMA2D_BGCOLR   0x0028		/* (RW) DMA2D Background Color Register */
  #define DMA2D_BGCOLR_BLUE  0x000000FF	/* Blue Value */
  #define DMA2D_BGCOLR_GREEN 0x0000FF00	/* Green Value */
  #define DMA2D_BGCOLR_RED   0x00FF0000	/* Red Value */
#define TOFF_DMA2D_FGCMAR   0x002C		/* (RW) DMA2D Foreground CLUT Memory Address Register */
#define TOFF_DMA2D_BGCMAR   0x0030		/* (RW) DMA2D Background CLUT Memory Address Register */
#define TOFF_DMA2D_OPFCCR   0x0034		/* (RW) DMA2D Output PFC Control Register */
  #define DMA2D_OPFCCR_CM    0x00000007	/* Color mode CM[2:0] */
  #define DMA2D_OPFCCR_CM_0  0x00000001
  #define DMA2D_OPFCCR_CM_1  0x00000002
  #define DMA2D_OPFCCR_CM_2  0x00000004
  #define DMA2D_OPFCCR_SB    0x00000100	/* Swap Bytes */
  #define DMA2D_OPFCCR_AI    0x00100000	/* Alpha Inverted */
  #define DMA2D_OPFCCR_RBS   0x00200000	/* Red Blue Swap */
#define TOFF_DMA2D_OCOLR    0x0038		/* (RW) DMA2D Output Color Register */
#define TOFF_DMA2D_OMAR     0x003C		/* (RW) DMA2D Output Memory Address Register */
#define TOFF_DMA2D_OOR      0x0040		/* (RW) DMA2D Output Offset Register */
#define TOFF_DMA2D_NLR      0x0044		/* (RW) DMA2D Number of Line Register */
#define TOFF_DMA2D_LWR      0x0048		/* (RW) DMA2D Line Watermark Register */
#define TOFF_DMA2D_AMTCR    0x004C		/* (RW) DMA2D AHB Master Timer Configuration Register */
  #define DMA2D_AMTCR_EN     0x00000001	/* Enable */
  #define DMA2D_AMTCR_DT     0x0000FF00	/* Dead Time */
#define TOFF_DMA2D_FGCLUT   0x0400		/* (RW) DMA2D Foreground CLUT[256] */
#define TOFF_DMA2D_BGCLUT   0x0800		/* (RW) DMA2D Background CLUT[256] */
#endif


