imagou/QiitaSource/toppers/stm32l4xx/asp/arch/arm_m_gcc/stm32l4xx/_renamed_stm32l4xx.h
/*
 *  RESET AND CLOCK CONTROL
 */
#define TADR_RCC_BASE       (AHB1PERIPH_BASE + 0x1000)
#define TOFF_RCC_CR         0x0000		/* (RW) RCC clock control register */
  #define RCC_CR_MSION          0x00000001	/* Internal Multi Speed oscillator (MSI) clock enable */
  #define RCC_CR_MSIRDY         0x00000002	/* Internal Multi Speed oscillator (MSI) clock ready flag */
  #define RCC_CR_MSIPLLEN       0x00000004	/* Internal Multi Speed oscillator (MSI) PLL enable */
  #define RCC_CR_MSIRGSEL       0x00000008	/* Internal Multi Speed oscillator (MSI) range selection */
  #define RCC_CR_MSIRANGE       0x000000F0	/* Internal Multi Speed oscillator (MSI) clock Range */
  #define RCC_CR_MSIRANGE_0     0x00000000
  #define RCC_CR_MSIRANGE_1     0x00000010
  #define RCC_CR_MSIRANGE_2     0x00000020
  #define RCC_CR_MSIRANGE_3     0x00000030
  #define RCC_CR_MSIRANGE_4     0x00000040
  #define RCC_CR_MSIRANGE_5     0x00000050
  #define RCC_CR_MSIRANGE_6     0x00000060
  #define RCC_CR_MSIRANGE_7     0x00000070
  #define RCC_CR_MSIRANGE_8     0x00000080
  #define RCC_CR_MSIRANGE_9     0x00000090
  #define RCC_CR_MSIRANGE_10    0x000000A0
  #define RCC_CR_MSIRANGE_11    0x000000B0
  #define RCC_CR_HSION          0x00000100	/* Internal High Speed oscillator (HSI16) clock enable */
  #define RCC_CR_HSIKERON       0x00000200	/* Internal High Speed oscillator (HSI16) clock enable for some IPs Kernel */
  #define RCC_CR_HSIRDY         0x00000400	/* Internal High Speed oscillator (HSI16) clock ready flag */
  #define RCC_CR_HSIASFS        0x00000800	/* HSI16 Automatic Start from Stop */
  #define RCC_CR_HSEON          0x00010000	/* External High Speed oscillator (HSE) clock enable */
  #define RCC_CR_HSERDY         0x00020000	/* External High Speed oscillator (HSE) clock ready */
  #define RCC_CR_HSEBYP         0x00040000	/* External High Speed oscillator (HSE) clock bypass */
  #define RCC_CR_CSSON          0x00080000	/* HSE Clock Security System enable */
  #define RCC_CR_PLLON          0x01000000	/* System PLL clock enable */
  #define RCC_CR_PLLRDY         0x02000000	/* System PLL clock ready */
  #define RCC_CR_PLLSAI1ON      0x04000000	/* SAI1 PLL enable */
  #define RCC_CR_PLLSAI1RDY     0x08000000	/* SAI1 PLL ready */
  #define RCC_CR_PLLSAI2ON      0x10000000	/* SAI2 PLL enable */
  #define RCC_CR_PLLSAI2RDY     0x20000000	/* SAI2 PLL ready */
#define TOFF_RCC_ICSCR      0x0004		/* (RW) RCC Internal clock sources calibration register */
  #define RCC_ICSCR_MSICAL      0x000000FF	/* MSICAL[7:0] bits */
  #define RCC_ICSCR_MSICAL_0    0x00000001
  #define RCC_ICSCR_MSICAL_1    0x00000002
  #define RCC_ICSCR_MSICAL_2    0x00000004
  #define RCC_ICSCR_MSICAL_3    0x00000008
  #define RCC_ICSCR_MSICAL_4    0x00000010
  #define RCC_ICSCR_MSICAL_5    0x00000020
  #define RCC_ICSCR_MSICAL_6    0x00000040
  #define RCC_ICSCR_MSICAL_7    0x00000080
  #define RCC_ICSCR_MSITRIM     0x0000FF00	/* MSITRIM[7:0] bits */
  #define RCC_ICSCR_MSITRIM_0   0x00000100
  #define RCC_ICSCR_MSITRIM_1   0x00000200
  #define RCC_ICSCR_MSITRIM_2   0x00000400
  #define RCC_ICSCR_MSITRIM_3   0x00000800
  #define RCC_ICSCR_MSITRIM_4   0x00001000
  #define RCC_ICSCR_MSITRIM_5   0x00002000
  #define RCC_ICSCR_MSITRIM_6   0x00004000
  #define RCC_ICSCR_MSITRIM_7   0x00008000
  #define RCC_ICSCR_HSICAL      0x00FF0000	/* HSICAL[7:0] bits */
  #define RCC_ICSCR_HSICAL_0    0x00010000
  #define RCC_ICSCR_HSICAL_1    0x00020000
  #define RCC_ICSCR_HSICAL_2    0x00040000
  #define RCC_ICSCR_HSICAL_3    0x00080000
  #define RCC_ICSCR_HSICAL_4    0x00100000
  #define RCC_ICSCR_HSICAL_5    0x00200000
  #define RCC_ICSCR_HSICAL_6    0x00400000
  #define RCC_ICSCR_HSICAL_7    0x00800000
  #define RCC_ICSCR_HSITRIM     0x1F000000	/* HSITRIM[4:0] bits */
  #define RCC_ICSCR_HSITRIM_0   0x01000000
  #define RCC_ICSCR_HSITRIM_1   0x02000000
  #define RCC_ICSCR_HSITRIM_2   0x04000000
  #define RCC_ICSCR_HSITRIM_3   0x08000000
  #define RCC_ICSCR_HSITRIM_4   0x10000000
#define TOFF_RCC_CFGR       0x0008		/* (RW) RCC clock configuration register */
  #define RCC_CFGR_SW           0x00000003	/* SW[1:0] bits (System clock Switch) */
  #define RCC_CFGR_SW_0         0x00000001
  #define RCC_CFGR_SW_1         0x00000002
  #define RCC_CFGR_SW_MSI       0x00000000	/* MSI oscillator selection as system clock */
  #define RCC_CFGR_SW_HSI       0x00000001	/* HSI16 oscillator selection as system clock */
  #define RCC_CFGR_SW_HSE       0x00000002	/* HSE oscillator selection as system clock */
  #define RCC_CFGR_SW_PLL       0x00000003	/* PLL selection as system clock */
  #define RCC_CFGR_SWS          0x0000000C	/* SWS[1:0] bits (System Clock Switch Status) */
  #define RCC_CFGR_SWS_0        0x00000004
  #define RCC_CFGR_SWS_1        0x00000008
  #define RCC_CFGR_SWS_MSI      0x00000000	/* MSI oscillator used as system clock */
  #define RCC_CFGR_SWS_HSI      0x00000004	/* HSI16 oscillator used as system clock */
  #define RCC_CFGR_SWS_HSE      0x00000008	/* HSE oscillator used as system clock */
  #define RCC_CFGR_SWS_PLL      0x0000000C	/* PLL used as system clock */
  #define RCC_CFGR_HPRE         0x000000F0	/* HPRE[3:0] bits (AHB prescaler) */
  #define RCC_CFGR_HPRE_0       0x00000010
  #define RCC_CFGR_HPRE_1       0x00000020
  #define RCC_CFGR_HPRE_2       0x00000040
  #define RCC_CFGR_HPRE_3       0x00000080
  #define RCC_CFGR_HPRE_DIV1    0x00000000	/* SYSCLK not divided */
  #define RCC_CFGR_HPRE_DIV2    0x00000080	/* SYSCLK divided by 2 */
  #define RCC_CFGR_HPRE_DIV4    0x00000090	/* SYSCLK divided by 4 */
  #define RCC_CFGR_HPRE_DIV8    0x000000A0	/* SYSCLK divided by 8 */
  #define RCC_CFGR_HPRE_DIV16   0x000000B0	/* SYSCLK divided by 16 */
  #define RCC_CFGR_HPRE_DIV64   0x000000C0	/* SYSCLK divided by 64 */
  #define RCC_CFGR_HPRE_DIV128  0x000000D0	/* SYSCLK divided by 128 */
  #define RCC_CFGR_HPRE_DIV256  0x000000E0	/* SYSCLK divided by 256 */
  #define RCC_CFGR_HPRE_DIV512  0x000000F0	/* SYSCLK divided by 512 */
  #define RCC_CFGR_PPRE1        0x00000700	/* PRE1[2:0] bits (APB2 prescaler) */
  #define RCC_CFGR_PPRE1_0      0x00000100
  #define RCC_CFGR_PPRE1_1      0x00000200
  #define RCC_CFGR_PPRE1_2      0x00000400
  #define RCC_CFGR_PPRE1_DIV1   0x00000000	/* HCLK not divided */
  #define RCC_CFGR_PPRE1_DIV2   0x00000400	/* HCLK divided by 2 */
  #define RCC_CFGR_PPRE1_DIV4   0x00000500	/* HCLK divided by 4 */
  #define RCC_CFGR_PPRE1_DIV8   0x00000600	/* HCLK divided by 8 */
  #define RCC_CFGR_PPRE1_DIV16  0x00000700	/* HCLK divided by 16 */
  #define RCC_CFGR_PPRE2        0x00003800	/* PRE2[2:0] bits (APB2 prescaler) */
  #define RCC_CFGR_PPRE2_0      0x00000800
  #define RCC_CFGR_PPRE2_1      0x00001000
  #define RCC_CFGR_PPRE2_2      0x00002000
  #define RCC_CFGR_PPRE2_DIV1   0x00000000	/* HCLK not divided */
  #define RCC_CFGR_PPRE2_DIV2   0x00002000	/* HCLK divided by 2 */
  #define RCC_CFGR_PPRE2_DIV4   0x00002800	/* HCLK divided by 4 */
  #define RCC_CFGR_PPRE2_DIV8   0x00003000	/* HCLK divided by 8 */
  #define RCC_CFGR_PPRE2_DIV16  0x00003800	/* HCLK divided by 16 */
  #define RCC_CFGR_STOPWUCK     0x00008000	/* Wake Up from stop and CSS backup clock selection */
  #define RCC_CFGR_MCOSEL       0x07000000	/* MCOSEL [2:0] bits (Clock output selection) */
  #define RCC_CFGR_MCOSEL_0     0x01000000
  #define RCC_CFGR_MCOSEL_1     0x02000000
  #define RCC_CFGR_MCOSEL_2     0x04000000
  #define RCC_CFGR_MCOPRE       0x70000000	/* MCO prescaler */
  #define RCC_CFGR_MCOPRE_0     0x10000000
  #define RCC_CFGR_MCOPRE_1     0x20000000
  #define RCC_CFGR_MCOPRE_2     0x40000000
  #define RCC_CFGR_MCOPRE_DIV1  0x00000000	/* MCO is divided by 1 */
  #define RCC_CFGR_MCOPRE_DIV2  0x10000000	/* MCO is divided by 2 */
  #define RCC_CFGR_MCOPRE_DIV4  0x20000000	/* MCO is divided by 4 */
  #define RCC_CFGR_MCOPRE_DIV8  0x30000000	/* MCO is divided by 8 */
  #define RCC_CFGR_MCOPRE_DIV16 0x40000000	/* MCO is divided by 16 */
  #define RCC_CFGR_MCO_PRE      RCC_CFGR_MCOPRE
  #define RCC_CFGR_MCO_PRE_1    RCC_CFGR_MCOPRE_DIV1
  #define RCC_CFGR_MCO_PRE_2    RCC_CFGR_MCOPRE_DIV2
  #define RCC_CFGR_MCO_PRE_4    RCC_CFGR_MCOPRE_DIV4
  #define RCC_CFGR_MCO_PRE_8    RCC_CFGR_MCOPRE_DIV8
  #define RCC_CFGR_MCO_PRE_16   RCC_CFGR_MCOPRE_DIV16
#define TOFF_RCC_PLLCFGR    0x000C		/* (RW) RCC system PLL configuration register */
  #define RCC_PLLCFGR_PLLSRC    0x00000003
  #define RCC_PLLCFGR_PLLSRC_MSI 0x00000001	/* MSI oscillator source clock selected */
  #define RCC_PLLCFGR_PLLSRC_HSI 0x00000002	/* HSI16 oscillator source clock selected */
  #define RCC_PLLCFGR_PLLSRC_HSE 0x00000003	/* HSE oscillator source clock selected */
  #define RCC_PLLCFGR_PLLM      0x00000070
  #define RCC_PLLCFGR_PLLM_0    0x00000010
  #define RCC_PLLCFGR_PLLM_1    0x00000020
  #define RCC_PLLCFGR_PLLM_2    0x00000040
  #define RCC_PLLCFGR_PLLN      0x00007F00
  #define RCC_PLLCFGR_PLLN_0    0x00000100
  #define RCC_PLLCFGR_PLLN_1    0x00000200
  #define RCC_PLLCFGR_PLLN_2    0x00000400
  #define RCC_PLLCFGR_PLLN_3    0x00000800
  #define RCC_PLLCFGR_PLLN_4    0x00001000
  #define RCC_PLLCFGR_PLLN_5    0x00002000
  #define RCC_PLLCFGR_PLLN_6    0x00004000
  #define RCC_PLLCFGR_PLLPEN    0x00010000
  #define RCC_PLLCFGR_PLLP      0x00020000
  #define RCC_PLLCFGR_PLLQEN    0x00100000
  #define RCC_PLLCFGR_PLLQ      0x00600000
  #define RCC_PLLCFGR_PLLQ_0    0x00200000
  #define RCC_PLLCFGR_PLLQ_1    0x00400000
  #define RCC_PLLCFGR_PLLREN    0x01000000
  #define RCC_PLLCFGR_PLLR      0x06000000
  #define RCC_PLLCFGR_PLLR_0    0x02000000
  #define RCC_PLLCFGR_PLLR_1    0x04000000
#define TOFF_RCC_PLLSAI1CFGR 0x0010		/* (RW) RCC PLL SAI1 configuration register */
  #define RCC_PLLSAI1CFGR_PLLSAI1N   0x00007F00
  #define RCC_PLLSAI1CFGR_PLLSAI1PEN 0x00010000
  #define RCC_PLLSAI1CFGR_PLLSAI1P   0x00020000
  #define RCC_PLLSAI1CFGR_PLLSAI1QEN 0x00100000
  #define RCC_PLLSAI1CFGR_PLLSAI1Q   0x00600000
  #define RCC_PLLSAI1CFGR_PLLSAI1REN 0x01000000
  #define RCC_PLLSAI1CFGR_PLLSAI1R   0x06000000
#define TOFF_RCC_PLLSAI2CFGR 0x0014		/* (RW) RCC PLL SAI2 configuration register */
  #define RCC_PLLSAI2CFGR_PLLSAI2N   0x00007F00
  #define RCC_PLLSAI2CFGR_PLLSAI2PEN 0x00010000
  #define RCC_PLLSAI2CFGR_PLLSAI2P   0x00020000
  #define RCC_PLLSAI2CFGR_PLLSAI2REN 0x01000000
  #define RCC_PLLSAI2CFGR_PLLSAI2R   0x06000000
#define TOFF_RCC_CIER       0x0018		/* (RW) RCC clock interrupt enable register */
  #define RCC_CIER_LSIRDYIE     0x00000001
  #define RCC_CIER_LSERDYIE     0x00000002
  #define RCC_CIER_MSIRDYIE     0x00000004
  #define RCC_CIER_HSIRDYIE     0x00000008
  #define RCC_CIER_HSERDYIE     0x00000010
  #define RCC_CIER_PLLRDYIE     0x00000020
  #define RCC_CIER_PLLSAI1RDYIE 0x00000040
  #define RCC_CIER_PLLSAI2RDYIE 0x00000080
  #define RCC_CIER_LSECSSIE     0x00000200
#define TOFF_RCC_CIFR       0x001C		/* (RW) RCC clock interrupt flag register */
  #define RCC_CIFR_LSIRDYF      0x00000001
  #define RCC_CIFR_LSERDYF      0x00000002
  #define RCC_CIFR_MSIRDYF      0x00000004
  #define RCC_CIFR_HSIRDYF      0x00000008
  #define RCC_CIFR_HSERDYF      0x00000010
  #define RCC_CIFR_PLLRDYF      0x00000020
  #define RCC_CIFR_PLLSAI1RDYF  0x00000040
  #define RCC_CIFR_PLLSAI2RDYF  0x00000080
  #define RCC_CIFR_CSSF         0x00000100
  #define RCC_CIFR_LSECSSF      0x00000200
#define TOFF_RCC_CICR       0x0020		/* (RW) RCC clock interrupt clear register */
  #define RCC_CICR_LSIRDYC      0x00000001
  #define RCC_CICR_LSERDYC      0x00000002
  #define RCC_CICR_MSIRDYC      0x00000004
  #define RCC_CICR_HSIRDYC      0x00000008
  #define RCC_CICR_HSERDYC      0x00000010
  #define RCC_CICR_PLLRDYC      0x00000020
  #define RCC_CICR_PLLSAI1RDYC  0x00000040
  #define RCC_CICR_PLLSAI2RDYC  0x00000080
  #define RCC_CICR_CSSC         0x00000100
  #define RCC_CICR_LSECSSC      0x00000200
#define TOFF_RCC_AHB1RSTR   0x0028		/* (RW) RCC AHB1 peripheral reset register */
  #define RCC_AHB1RSTR_DMA1RST  0x00000001	/* DMA1 reset */
  #define RCC_AHB1RSTR_DMA2RST  0x00000002	/* DMA2 reset */
  #define RCC_AHB1RSTR_FLASHRST 0x00000100	/* FLASH reset */
  #define RCC_AHB1RSTR_CRCRST   0x00001000	/* CRC reset */
  #define RCC_AHB1RSTR_TSCRST   0x00010000	/* TSC reset */
#define TOFF_RCC_AHB2RSTR   0x002C		/* (RW) RCC AHB2 peripheral reset register */
  #define RCC_AHB2RSTR_GPIOARST 0x00000001	/* GPIOA reset */
  #define RCC_AHB2RSTR_GPIOBRST 0x00000002	/* GPIOB reset */
  #define RCC_AHB2RSTR_GPIOCRST 0x00000004	/* GPIOC reset */
  #define RCC_AHB2RSTR_GPIODRST 0x00000008	/* GPIOD reset */
  #define RCC_AHB2RSTR_GPIOERST 0x00000010	/* GPIOE reset */
  #define RCC_AHB2RSTR_GPIOFRST 0x00000020	/* GPIOF reset */
  #define RCC_AHB2RSTR_GPIOGRST 0x00000040	/* GPIOG reset */
  #define RCC_AHB2RSTR_GPIOHRST 0x00000080	/* GPIOH reset */
  #define RCC_AHB2RSTR_OTGFSRST 0x00001000	/* USB_OTG FS reset */
  #define RCC_AHB2RSTR_ADCRST   0x00002000	/* ADC reset */
  #define RCC_AHB2RSTR_RNGRST   0x00040000	/* RNG reset */
#define TOFF_RCC_AHB3RSTR   0x0030		/* (RW) RCC AHB3 peripheral reset register */
  #define RCC_AHB3RSTR_FMCRST   0x00000001	/* FMC reset */
  #define RCC_AHB3RSTR_QSPIRST  0x00000100	/* QSPI reset */
#define TOFF_RCC_APB1RSTR1  0x0038		/* (RW) RCC APB1 peripheral reset register 1 */
  #define RCC_APB1RSTR1_TIM2RST   0x00000001	/* TIMER2 reset */
  #define RCC_APB1RSTR1_TIM3RST   0x00000002	/* TIMER3 reset */
  #define RCC_APB1RSTR1_TIM4RST   0x00000004	/* TIMER4 reset */
  #define RCC_APB1RSTR1_TIM5RST   0x00000008	/* TIMER5 reset */
  #define RCC_APB1RSTR1_TIM6RST   0x00000010	/* TIMER6 reset */
  #define RCC_APB1RSTR1_TIM7RST   0x00000020	/* TIMER7 reset */
  #define RCC_APB1RSTR1_LCDRST    0x00000200	/* LCD reset */
  #define RCC_APB1RSTR1_SPI2RST   0x00004000	/* SPI2 reset */
  #define RCC_APB1RSTR1_SPI3RST   0x00008000	/* SPI3 reset */
  #define RCC_APB1RSTR1_USART2RST 0x00020000	/* USART2 reset */
  #define RCC_APB1RSTR1_USART3RST 0x00040000	/* USART3 reset */
  #define RCC_APB1RSTR1_UART4RST  0x00080000	/* UART4 reset */
  #define RCC_APB1RSTR1_UART5RST  0x00100000	/* UART5 reset */
  #define RCC_APB1RSTR1_I2C1RST   0x00200000	/* I2C1 reset */
  #define RCC_APB1RSTR1_I2C2RST   0x00400000	/* I2C2 reset */
  #define RCC_APB1RSTR1_I2C3RST   0x00800000	/* I2C1 reset */
  #define RCC_APB1RSTR1_CAN1RST   0x02000000	/* CAN1 reset */
#if !defined(TOPPERS_STM32L476_DISCOVERY) && !defined(TOPPERS_STM32L476_NUCLEO64)
  #define RCC_APB1RSTR1_CRSRST    0x01000000
#endif
  #define RCC_APB1RSTR1_PWRRST    0x10000000	/* PWR reset */
  #define RCC_APB1RSTR1_DAC1RST   0x20000000	/* DAC1 reset */
  #define RCC_APB1RSTR1_OPAMPRST  0x40000000	/* OPRAM reset */
  #define RCC_APB1RSTR1_LPTIM1RST 0x80000000	/* LPTIM1 */
#define TOFF_RCC_APB1RSTR2  0x003C		/* (RW) RCC APB1 peripheral reset register 2 */
  #define RCC_APB1RSTR2_LPUART1RST 0x00000001	/* LPUART1 reset */
  #define RCC_APB1RSTR2_SWPMI1RST  0x00000004	/* SWPMI1 reset */
  #define RCC_APB1RSTR2_LPTIM2RST  0x00000020	/* LPTIMER2 reset */
#define TOFF_RCC_APB2RSTR   0x0040		/* (RW) RCC APB2 peripheral reset register */
  #define RCC_APB2RSTR_SYSCFGRST  0x00000001	/* SYSCFG reset */
  #define RCC_APB2RSTR_SDMMC1RST  0x00000400	/* SDMMAC reset */
  #define RCC_APB2RSTR_TIM1RST    0x00000800	/* TIMER1 reset */
  #define RCC_APB2RSTR_SPI1RST    0x00001000	/* SPI1 reset */
  #define RCC_APB2RSTR_TIM8RST    0x00002000	/* TIMER8 reset */
  #define RCC_APB2RSTR_USART1RST  0x00004000	/* USART1 reset */
  #define RCC_APB2RSTR_TIM15RST   0x00010000	/* TIMER15 reset */
  #define RCC_APB2RSTR_TIM16RST   0x00020000	/* TIMER16 reset */
  #define RCC_APB2RSTR_TIM17RST   0x00040000	/* TIMER17 reset */
  #define RCC_APB2RSTR_SAI1RST    0x00200000	/* SAI1 reset */
  #define RCC_APB2RSTR_SAI2RST    0x00400000	/* SAI2 reset */
  #define RCC_APB2RSTR_DFSDM1RST  0x01000000	/* DFSDM1 reset */
#define TOFF_RCC_AHB1ENR    0x0048		/* (RW) RCC AHB1 peripheral clocks enable register */
  #define RCC_AHB1ENR_DMA1EN    0x00000001	/* DMA1 clock clock enable */
  #define RCC_AHB1ENR_DMA2EN    0x00000002	/* DMA2 clock enable */
#if !defined(TOPPERS_STM32L476_DISCOVERY) && !defined(TOPPERS_STM32L476_NUCLEO64)
  #define RCC_AHB1ENR_DMAMUX1EN 0x00000004	/* DMAMUX clock enable */
#endif
  #define RCC_AHB1ENR_FLASHEN   0x00000100	/* FLASH clock enable */
  #define RCC_AHB1ENR_CRCEN     0x00001000	/* CRC clock enable */
  #define RCC_AHB1ENR_TSCEN     0x00010000	/* TSC clock enable */
#if !defined(TOPPERS_STM32L476_DISCOVERY) && !defined(TOPPERS_STM32L476_NUCLEO64)
  #define RCC_AHB1ENR_DMA2DEN   0x00020000	/* DMA2D clock enable */
#endif
#define TOFF_RCC_AHB2ENR    0x004C		/* (RW) RCC AHB2 peripheral clocks clock enable register */
  #define RCC_AHB2ENR_GPIOAEN   0x00000001	/* GPIOA clock enable */
  #define RCC_AHB2ENR_GPIOBEN   0x00000002	/* GPIOB clock enable */
  #define RCC_AHB2ENR_GPIOCEN   0x00000004	/* GPIOC clock enable */
  #define RCC_AHB2ENR_GPIODEN   0x00000008	/* GPIOD clock enable */
  #define RCC_AHB2ENR_GPIOEEN   0x00000010	/* GPIOE clock enable */
  #define RCC_AHB2ENR_GPIOFEN   0x00000020	/* GPIOF clock enable */
  #define RCC_AHB2ENR_GPIOGEN   0x00000040	/* GPIOG clock enable */
  #define RCC_AHB2ENR_GPIOHEN   0x00000080	/* GPIOH clock enable */
  #define RCC_AHB2ENR_OTGFSEN   0x00001000	/* USB_OTG FS clock enable */
  #define RCC_AHB2ENR_ADCEN     0x00002000	/* ADC clock enable */
  #define RCC_AHB2ENR_RNGEN     0x00040000	/* RNG clock enable */
#define TOFF_RCC_AHB3ENR    0x0050		/* (RW) RCC AHB3 peripheral clocks clock enable register */
  #define RCC_AHB3ENR_FMCEN     0x00000001	/* FMC clock enable */
  #define RCC_AHB3ENR_QSPIEN    0x00000100	/* QUADSPI clock enable */
#define TOFF_RCC_APB1ENR1   0x0058		/* (RW) RCC APB1 peripheral clocks clock enable register 1 */
  #define RCC_APB1ENR1_TIM2EN   0x00000001	/* TIMER2 clock enable */
  #define RCC_APB1ENR1_TIM3EN   0x00000002	/* TIMER3 clock enable */
  #define RCC_APB1ENR1_TIM4EN   0x00000004	/* TIMER4 clock enable */
  #define RCC_APB1ENR1_TIM5EN   0x00000008	/* TIMER5 clock enable */
  #define RCC_APB1ENR1_TIM6EN   0x00000010	/* TIMER6 clock enable	 */
  #define RCC_APB1ENR1_TIM7EN   0x00000020	/* TIMER7 clock enable */
  #define RCC_APB1ENR1_LCDEN    0x00000200	/* LCD clock enable */
  #define RCC_APB1ENR1_WWDGEN   0x00000800	/* WWDG clock enable */
  #define RCC_APB1ENR1_SPI2EN   0x00004000	/* SPI2 clock enable */
  #define RCC_APB1ENR1_SPI3EN   0x00008000	/* SPI3 clock enable */
  #define RCC_APB1ENR1_USART2EN 0x00020000	/* USART2 clock enable */
  #define RCC_APB1ENR1_USART3EN 0x00040000	/* USART3 clock enable */
  #define RCC_APB1ENR1_UART4EN  0x00080000	/* UART4 clock enable */
  #define RCC_APB1ENR1_UART5EN  0x00100000	/* UART5 clock enable */
  #define RCC_APB1ENR1_I2C1EN   0x00200000	/* I2C1 clock enable */
  #define RCC_APB1ENR1_I2C2EN   0x00400000	/* I2C2 clock enable */
  #define RCC_APB1ENR1_I2C3EN   0x00800000	/* I2C3 clock enable */
#if !defined(TOPPERS_STM32L476_DISCOVERY) && !defined(TOPPERS_STM32L476_NUCLEO64)
  #define RCC_APB1ENR1_CRSEN    0x01000000
#endif
  #define RCC_APB1ENR1_CAN1EN   0x02000000	/* CAN1 clock enable */
  #define RCC_APB1ENR1_PWREN    0x10000000	/* PWR clock enable */
  #define RCC_APB1ENR1_DAC1EN   0x20000000	/* DAC1 clock enable */
  #define RCC_APB1ENR1_OPAMPEN  0x40000000	/* OPAM clock enable */
  #define RCC_APB1ENR1_LPTIM1EN 0x80000000	/* LPTIMER1 clock enable */
#define TOFF_RCC_APB1ENR2   0x005C		/* (RW) RCC APB1 peripheral clocks enable register 2 */
  #define RCC_APB1ENR2_LPUART1EN 0x00000001	/* LPUART1 clock enable */
  #define RCC_APB1ENR2_SWPMI1EN 0x00000004	/* SWPMI clock enable */
  #define RCC_APB1ENR2_LPTIM2EN 0x00000020	/* LPTIMER2 clock enable */
#define TOFF_RCC_APB2ENR    0x0060		/* (RW) RCC APB2 peripheral clocks enable register */
  #define RCC_APB2ENR_SYSCFGEN  0x00000001	/* SYSCFG clock enable */
  #define RCC_APB2ENR_FWEN      0x00000080	/* FW clock enable */
  #define RCC_APB2ENR_SDMMC1EN  0x00000400	/* SDMMC clock enable */
  #define RCC_APB2ENR_TIM1EN    0x00000800	/* TIMER1 clock enable */
  #define RCC_APB2ENR_SPI1EN    0x00001000	/* SPI1 clock enable */
  #define RCC_APB2ENR_TIM8EN    0x00002000	/* TIMER8 clock enable */
  #define RCC_APB2ENR_USART1EN  0x00004000	/* USART1 clock enable */
  #define RCC_APB2ENR_TIM15EN   0x00010000	/* TIMER15 clock enable */
  #define RCC_APB2ENR_TIM16EN   0x00020000	/* TIMER16 clock enable */
  #define RCC_APB2ENR_TIM17EN   0x00040000	/* TIMER17 clock enable */
  #define RCC_APB2ENR_SAI1EN    0x00200000	/* SAI1 clock enable */
  #define RCC_APB2ENR_SAI2EN    0x00400000	/* SAI2 clock enable */
  #define RCC_APB2ENR_DFSDM1EN  0x01000000	/* DFSDM1 clock enable */
#define TOFF_RCC_AHB1SMENR  0x0068		/* (RW) RCC AHB1 peripheral clocks enable in sleep and stop modes register */
  #define RCC_AHB1SMENR_DMA1SMEN  0x00000001	/* DMA1 clock enabled in sleep mode */
  #define RCC_AHB1SMENR_DMA2SMEN  0x00000002	/* DMA2 clock enabled in sleep mode */
  #define RCC_AHB1SMENR_FLASHSMEN 0x00000100	/* FLASH clock enabled in sleep mode */
  #define RCC_AHB1SMENR_SRAM1SMEN 0x00000200	/* SRAM1 clock enabled in sleep mode */
  #define RCC_AHB1SMENR_CRCSMEN   0x00001000	/* CRC clock enabled in sleep mode */
  #define RCC_AHB1SMENR_TSCSMEN   0x00010000	/* TSC clock enabled in sleep mode */
#define TOFF_RCC_AHB2SMENR  0x006C		/* (RW) RCC AHB2 peripheral clocks enable in sleep and stop modes register */
  #define RCC_AHB2SMENR_GPIOASMEN 0x00000001	/* GPIOA clock enabled in sleep mode */
  #define RCC_AHB2SMENR_GPIOBSMEN 0x00000002	/* GPIOB clock enabled in sleep mode */
  #define RCC_AHB2SMENR_GPIOCSMEN 0x00000004	/* GPIOC clock enabled in sleep mode */
  #define RCC_AHB2SMENR_GPIODSMEN 0x00000008	/* GPIOD clock enabled in sleep mode */
  #define RCC_AHB2SMENR_GPIOESMEN 0x00000010	/* GPIOE clock enabled in sleep mode */
  #define RCC_AHB2SMENR_GPIOFSMEN 0x00000020	/* GPIOF clock enabled in sleep mode */
  #define RCC_AHB2SMENR_GPIOGSMEN 0x00000040	/* GPIOG clock enabled in sleep mode */
  #define RCC_AHB2SMENR_GPIOHSMEN 0x00000080	/* GPIOH clock enabled in sleep mode */
  #define RCC_AHB2SMENR_SRAM2SMEN 0x00000200	/* SRAM2 clock enabled in sleep mode */
  #define RCC_AHB2SMENR_OTGFSSMEN 0x00001000	/* USB_OTG FS clock enabled in sleep mode */
  #define RCC_AHB2SMENR_ADCSMEN   0x00002000	/* ADC clock enabled in sleep mode */
  #define RCC_AHB2SMENR_RNGSMEN   0x00040000	/* RNG clock enabled in sleep mode */
#define TOFF_RCC_AHB3SMENR  0x0070		/* (RW) RCC AHB3 peripheral clocks enable in sleep and stop modes register */
  #define RCC_AHB3SMENR_FMCSMEN   0x00000001	/* FMC clock enabled in sleep mode */
  #define RCC_AHB3SMENR_QSPISMEN  0x00000100	/* QUADSPI clock enabled in sleep mode */
#define TOFF_RCC_APB1SMENR1 0x0078		/* (RW) RCC APB1 peripheral clocks enable in sleep mode and stop modes register 1 */
  #define RCC_APB1SMENR1_TIM2SMEN 0x00000001	/* TIM2 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_TIM3SMEN 0x00000002	/* TIM3 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_TIM4SMEN 0x00000004	/* TIM4 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_TIM5SMEN 0x00000008	/* TIM5 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_TIM6SMEN 0x00000010	/* TIM6 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_TIM7SMEN 0x00000020	/* TIM7 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_LCDSMEN  0x00000200	/* LCD clock enabled in sleep mode */
  #define RCC_APB1SMENR1_WWDGSMEN 0x00000800	/* WWDG clock enabled in sleep mode */
  #define RCC_APB1SMENR1_SPI2SMEN 0x00004000	/* SPI2 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_SPI3SMEN 0x00008000	/* SPI3 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_USART2SMEN 0x00020000	/* USART2 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_USART3SMEN 0x00040000	/* USART3 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_UART4SMEN  0x00080000	/* UART4 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_UART5SMEN  0x00100000	/* UART5 clock enabled in sleep mode */
