imagou/QiitaSource/toppers/stm32l4xx/asp/arch/arm_m_gcc/stm32l4xx/_renamed_stm32l4xx.h
  #define RCC_APB1SMENR1_I2C1SMEN 0x00200000	/* I2C1 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_I2C2SMEN 0x00400000	/* I2C2 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_I2C3SMEN 0x00800000	/* I2C3 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_CAN1SMEN 0x02000000	/* CAN1 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_PWRSMEN  0x10000000	/* PWR clock enabled in sleep mode */
  #define RCC_APB1SMENR1_DAC1SMEN 0x20000000	/* DAC1 clock enabled in sleep mode */
  #define RCC_APB1SMENR1_OPAMPSMEN  0x40000000	/* OPAMP clock enabled in sleep mode */
  #define RCC_APB1SMENR1_LPTIM1SMEN 0x80000000	/* LPTIM1 clock enabled in sleep mode */
#define TOFF_RCC_APB1SMENR2 0x007C		/* (RW) RCC APB1 peripheral clocks enable in sleep mode and stop modes register 2 */
  #define RCC_APB1SMENR2_LPUART1SMEN 0x00000001	/* LPUART1 clock enabled in sleep mode */
  #define RCC_APB1SMENR2_SWPMI1SMEN 0x00000004	/* SWPMI clock enabled in sleep mode */
  #define RCC_APB1SMENR2_LPTIM2SMEN 0x00000020	/* LPTIM2 clock enabled in sleep mode */
#define TOFF_RCC_APB2SMENR  0x0080		/* (RW) RCC APB2 peripheral clocks enable in sleep mode and stop modes register */
  #define RCC_APB2SMENR_SYSCFGSMEN  0x00000001	/* SYSCFG clock enabled in sleep mode */
  #define RCC_APB2SMENR_SDMMC1SMEN  0x00000400	/* SDMMC1 clock enabled in sleep mode */
  #define RCC_APB2SMENR_TIM1SMEN    0x00000800	/* TIM1 clock enabled in sleep mode */
  #define RCC_APB2SMENR_SPI1SMEN    0x00001000	/* SPI1 clock enabled in sleep mode */
  #define RCC_APB2SMENR_TIM8SMEN    0x00002000	/* TIM8 clock enabled in sleep mode */
  #define RCC_APB2SMENR_USART1SMEN  0x00004000	/* USART1 clock enabled in sleep mode */
  #define RCC_APB2SMENR_TIM15SMEN   0x00010000	/* TIM15 clock enabled in sleep mode */
  #define RCC_APB2SMENR_TIM16SMEN   0x00020000	/* TIM16 clock enabled in sleep mode */
  #define RCC_APB2SMENR_TIM17SMEN   0x00040000	/* TIM17 clock enabled in sleep mode */
  #define RCC_APB2SMENR_SAI1SMEN    0x00200000	/* SAI1 clock enabled in sleep mode */
  #define RCC_APB2SMENR_SAI2SMEN    0x00400000	/* SAI2 clock enabled in sleep mode */
  #define RCC_APB2SMENR_DFSDM1SMEN  0x01000000	/* DFSDM1 clock enabled in sleep mode */
#define TOFF_RCC_CCIPR      0x0088		/* (RW) RCC peripherals independent clock configuration register */
  #define RCC_CCIPR_USART1SEL   0x00000003	/* USART1SEL[1:0] bits */
  #define RCC_CCIPR_USART1SEL_0 0x00000001
  #define RCC_CCIPR_USART1SEL_1 0x00000002
  #define RCC_CCIPR_USART2SEL   0x0000000C	/* USART2SEL[1:0] bits */
  #define RCC_CCIPR_USART2SEL_0 0x00000004
  #define RCC_CCIPR_USART2SEL_1 0x00000008
  #define RCC_CCIPR_USART3SEL   0x00000030	/* USART3SEL[1:0] bits */
  #define RCC_CCIPR_USART3SEL_0 0x00000010
  #define RCC_CCIPR_USART3SEL_1 0x00000020
  #define RCC_CCIPR_UART4SEL    0x000000C0	/* UART4SEL[1:0] bits */
  #define RCC_CCIPR_UART4SEL_0  0x00000040
  #define RCC_CCIPR_UART4SEL_1  0x00000080
  #define RCC_CCIPR_UART5SEL    0x00000300	/* UART5SEL[1:0] bits */
  #define RCC_CCIPR_UART5SEL_0  0x00000100
  #define RCC_CCIPR_UART5SEL_1  0x00000200
  #define RCC_CCIPR_LPUART1SEL  0x00000C00	/* LPUART1SEL[1:0] bits */
  #define RCC_CCIPR_LPUART1SEL_0 0x00000400
  #define RCC_CCIPR_LPUART1SEL_1 0x00000800
  #define RCC_CCIPR_I2C1SEL     0x00003000	/* I2C1SEL[1:0] bits */
  #define RCC_CCIPR_I2C1SEL_0   0x00001000
  #define RCC_CCIPR_I2C1SEL_1   0x00002000
  #define RCC_CCIPR_I2C2SEL     0x0000C000	/* I2C2SEL[1:0] bits */
  #define RCC_CCIPR_I2C2SEL_0   0x00004000
  #define RCC_CCIPR_I2C2SEL_1   0x00008000
  #define RCC_CCIPR_I2C3SEL     0x00030000	/* I2C3SEL[1:0] bits */
  #define RCC_CCIPR_I2C3SEL_0   0x00010000
  #define RCC_CCIPR_I2C3SEL_1   0x00020000
  #define RCC_CCIPR_LPTIM1SEL   0x000C0000	/* LPTIM1SEL[1:0] bits */
  #define RCC_CCIPR_LPTIM1SEL_0 0x00040000
  #define RCC_CCIPR_LPTIM1SEL_1 0x00080000
  #define RCC_CCIPR_LPTIM2SEL   0x00300000	/* LPTIM2SEL[1:0] bits */
  #define RCC_CCIPR_LPTIM2SEL_0 0x00100000
  #define RCC_CCIPR_LPTIM2SEL_1 0x00200000
  #define RCC_CCIPR_SAI1SEL     0x00C00000	/* SAI1SEL[1:0] bits */
  #define RCC_CCIPR_SAI1SEL_0   0x00400000
  #define RCC_CCIPR_SAI1SEL_1   0x00800000
  #define RCC_CCIPR_SAI2SEL     0x03000000	/* SAI2SEL[1:0] bits */
  #define RCC_CCIPR_SAI2SEL_0   0x01000000
  #define RCC_CCIPR_SAI2SEL_1   0x02000000
  #define RCC_CCIPR_CLK48SEL    0x0C000000	/* CLK48SEL[1:0] bits */
  #define RCC_CCIPR_CLK48SEL_0  0x04000000
  #define RCC_CCIPR_CLK48SEL_1  0x08000000
  #define RCC_CCIPR_ADCSEL      0x30000000	/* ADCSEL[1:0] bits */
  #define RCC_CCIPR_ADCSEL_0    0x10000000
  #define RCC_CCIPR_ADCSEL_1    0x20000000
  #define RCC_CCIPR_SWPMI1SEL   0x40000000
  #define RCC_CCIPR_DFSDM1SEL   0x80000000
#define TOFF_RCC_BDCR       0x0090		/* (RW) RCC backup domain control register */
  #define RCC_BDCR_LSEON        0x00000001
  #define RCC_BDCR_LSERDY       0x00000002
  #define RCC_BDCR_LSEBYP       0x00000004
  #define RCC_BDCR_LSEDRV       0x00000018
  #define RCC_BDCR_LSEDRV_0     0x00000008
  #define RCC_BDCR_LSEDRV_1     0x00000010
  #define RCC_BDCR_LSECSSON     0x00000020
  #define RCC_BDCR_LSECSSD      0x00000040
  #define RCC_BDCR_RTCSEL       0x00000300
  #define RCC_BDCR_RTCSEL_0     0x00000100
  #define RCC_BDCR_RTCSEL_1     0x00000200
  #define RCC_BDCR_RTCEN        0x00008000
  #define RCC_BDCR_BDRST        0x00010000
  #define RCC_BDCR_LSCOEN       0x01000000
  #define RCC_BDCR_LSCOSEL      0x02000000
#define TOFF_RCC_CSR        0x0094		/* (RW) RCC clock control & status register */
  #define RCC_CSR_LSION         0x00000001	/* Internal Low Speed oscillator enable */
  #define RCC_CSR_LSIRDY        0x00000002	/* Internal Low Speed oscillator Ready */
  #define RCC_CSR_MSISRANGE     0x00000F00
  #define RCC_CSR_MSISRANGE_1   0x00000400
  #define RCC_CSR_MSISRANGE_2   0x00000500
  #define RCC_CSR_MSISRANGE_4   0x00000600
  #define RCC_CSR_MSISRANGE_8   0x00000700
  #define RCC_CSR_RMVF          0x00800000	/* Remove reset flag */
  #define RCC_CSR_FWRSTF        0x01000000	/* Mifare Firewall reset flag */
  #define RCC_CSR_OBLRSTF       0x02000000	/* OBL reset flag */
  #define RCC_CSR_PINRSTF       0x04000000	/* PIN reset flag */
  #define RCC_CSR_BORRSTF       0x08000000
  #define RCC_CSR_SFTRSTF       0x10000000	/* Software Reset flag */
  #define RCC_CSR_IWDGRSTF      0x20000000	/* Independent Watchdog reset flag */
  #define RCC_CSR_WWDGRSTF      0x40000000	/* Window watchdog reset flag */
  #define RCC_CSR_LPWRRSTF      0x80000000	/* Low-Power reset flag */
#if !defined(TOPPERS_STM32L476_DISCOVERY) && !defined(TOPPERS_STM32L476_NUCLEO64)
#define TOFF_RCC_CRRCR      0x0098		/* (RW) RCC clock recovery RC register */
  #define RCC_CRRCR_HSI48ON     0x00000001
  #define RCC_CRRCR_HSI48RDY    0x00000002
  #define RCC_CRRCR_HSI48CAL    0x0000FF80
  #define RCC_CRRCR_HSI48CAL_0  0x00000080
  #define RCC_CRRCR_HSI48CAL_1  0x00000100
  #define RCC_CRRCR_HSI48CAL_2  0x00000200
  #define RCC_CRRCR_HSI48CAL_3  0x00000400
  #define RCC_CRRCR_HSI48CAL_4  0x00000800
  #define RCC_CRRCR_HSI48CAL_5  0x00001000
  #define RCC_CRRCR_HSI48CAL_6  0x00002000
  #define RCC_CRRCR_HSI48CAL_7  0x00004000
  #define RCC_CRRCR_HSI48CAL_8  0x00008000
#define TOFF_RCC_CCIPR2     0x009C		/* (RW) RCC peripherals independent clock configuration register 2 */
  #define RCC_CCIPR2_I2C4SEL    0x00000003
  #define RCC_CCIPR2_I2C4SEL_0  0x00000001
  #define RCC_CCIPR2_I2C4SEL_1  0x00000002
  #define RCC_CCIPR2_DFSDM1SEL  0x00000004
  #define RCC_CCIPR2_ADFSDM1SEL 0x00000018
  #define RCC_CCIPR2_ADFSDM1SEL_0  0x00000008
  #define RCC_CCIPR2_ADFSDM1SEL_1  0x00000010
  #define RCC_CCIPR2_SAI1SEL    0x000000E0
  #define RCC_CCIPR2_SAI1SEL_0  0x00000020
  #define RCC_CCIPR2_SAI1SEL_1  0x00000040
  #define RCC_CCIPR2_SAI1SEL_2  0x00000080
  #define RCC_CCIPR2_SAI2SEL    0x00000700
  #define RCC_CCIPR2_SAI2SEL_0  0x00000100
  #define RCC_CCIPR2_SAI2SEL_1  0x00000200
  #define RCC_CCIPR2_SAI2SEL_2  0x00000400
  #define RCC_CCIPR2_SDMMCSEL   0x00004000
  #define RCC_CCIPR2_PLLSAI2DIVR   0x00030000
  #define RCC_CCIPR2_PLLSAI2DIVR_0 0x00010000
  #define RCC_CCIPR2_PLLSAI2DIVR_1 0x00020000
  #define RCC_CCIPR2_OSPISEL    0x00300000
  #define RCC_CCIPR2_OSPISEL_0  0x00100000
  #define RCC_CCIPR2_OSPISEL_1  0x00200000
#endif


