imagou/QiitaSource/toppers/stm32l4xx/asp/arch/arm_m_gcc/stm32l4xx/_renamed_stm32l4xx.h
/*
 *  FLASH REGISTERS
 */
#define TADR_FLASH_R_BASE   (AHB1PERIPH_BASE + 0x2000)
#define TOFF_FLASH_ACR      0x0000		/* (RW) FLASH access control register */
#if !defined(TOPPERS_STM32L476_DISCOVERY) && !defined(TOPPERS_STM32L476_NUCLEO64)
  #define FLASH_ACR_LATENCY  0x0000000F
#else
  #define FLASH_ACR_LATENCY  0x00000007
#endif
  #define FLASH_ACR_LATENCY_0WS  0x00000000
  #define FLASH_ACR_LATENCY_1WS  0x00000001
  #define FLASH_ACR_LATENCY_2WS  0x00000002
  #define FLASH_ACR_LATENCY_3WS  0x00000003
  #define FLASH_ACR_LATENCY_4WS  0x00000004
#if !defined(TOPPERS_STM32L476_DISCOVERY) && !defined(TOPPERS_STM32L476_NUCLEO64)
  #define FLASH_ACR_LATENCY_5WS  0x00000005
  #define FLASH_ACR_LATENCY_6WS  0x00000006
  #define FLASH_ACR_LATENCY_7WS  0x00000007
  #define FLASH_ACR_LATENCY_8WS  0x00000008
  #define FLASH_ACR_LATENCY_9WS  0x00000009
  #define FLASH_ACR_LATENCY_10WS 0x0000000A
  #define FLASH_ACR_LATENCY_11WS 0x0000000B
  #define FLASH_ACR_LATENCY_12WS 0x0000000C
  #define FLASH_ACR_LATENCY_13WS 0x0000000D
  #define FLASH_ACR_LATENCY_14WS 0x0000000E
  #define FLASH_ACR_LATENCY_15WS 0x0000000F
#endif

  #define FLASH_ACR_PRFTEN       0x00000100
  #define FLASH_ACR_ICEN     0x00000200
  #define FLASH_ACR_DCEN     0x00000400
  #define FLASH_ACR_ICRST    0x00000800
  #define FLASH_ACR_DCRST    0x00001000
  #define FLASH_ACR_RUN_PD   0x00002000	/* Flash power down mode during run */
  #define FLASH_ACR_SLEEP_PD 0x00004000	/* Flash power down mode during sleep */
#define TOFF_FLASH_PDKEYR   0x0004		/* (RW) Power down key register */
#define TOFF_FLASH_KEYR     0x0008		/* (RW) FLASH key register */
#define TOFF_FLASH_OPTKEYR  0x000C		/* (RW) Option byte key register */
#define TOFF_FLASH_SR       0x0010		/* (RW) Status register */
  #define FLASH_SR_EOP       0x00000001	/* End Of Programming*/
  #define FLASH_SR_OPERR     0x00000002
  #define FLASH_SR_PROGERR   0x00000008
  #define FLASH_SR_WRPERR    0x00000010	/* Write protection error */
  #define FLASH_SR_PGAERR    0x00000020	/* Programming Alignment Error */
  #define FLASH_SR_SIZERR    0x00000040	/* Size error */
  #define FLASH_SR_PGSERR    0x00000080
  #define FLASH_SR_MISERR    0x00000100
  #define FLASH_SR_FASTERR   0x00000200
  #define FLASH_SR_RDERR     0x00004000
  #define FLASH_SR_OPTVERR   0x00008000	/* Option Valid error */
  #define FLASH_SR_BSY       0x00010000	/* Busy */
#define TOFF_FLASH_CR       0x0014		/* (RW) FLASH control register */
  #define FLASH_CR_PG        0x00000001
  #define FLASH_CR_PER       0x00000002
  #define FLASH_CR_MER1      0x00000004
  #define FLASH_CR_PNB       0x000007F8
  #define FLASH_CR_BKER      0x00000800
  #define FLASH_CR_MER2      0x00008000
  #define FLASH_CR_STRT      0x00010000
  #define FLASH_CR_OPTSTRT   0x00020000
  #define FLASH_CR_FSTPG     0x00040000
  #define FLASH_CR_EOPIE     0x01000000
  #define FLASH_CR_ERRIE     0x02000000
  #define FLASH_CR_RDERRIE   0x04000000
  #define FLASH_CR_OBL_LAUNCH 0x08000000
  #define FLASH_CR_OPTLOCK   0x40000000
  #define FLASH_CR_LOCK      0x80000000
#define TOFF_FLASH_ECCR     0x0018		/* (RW) FLASH ECC register */
  #define FLASH_ECCR_ADDR_ECC 0x0007FFFF
  #define FLASH_ECCR_BK_ECC   0x00080000
  #define FLASH_ECCR_SYSF_ECC 0x00100000
  #define FLASH_ECCR_ECCIE    0x01000000
  #define FLASH_ECCR_ECCC     0x40000000
  #define FLASH_ECCR_ECCD     0x80000000
#define TOFF_FLASH_OPTR     0x0020		/* (RW) Option byte register */
  #define FLASH_OPTR_RDP        0x000000FF
  #define FLASH_OPTR_BOR_LEV    0x00000700	/* BOR_LEV[2:0] Brown Out Reset Threshold Level*/
  #define FLASH_OPTR_BOR_LEV_0  0x00000000
  #define FLASH_OPTR_BOR_LEV_1  0x00000100
  #define FLASH_OPTR_BOR_LEV_2  0x00000200
  #define FLASH_OPTR_BOR_LEV_3  0x00000300
  #define FLASH_OPTR_BOR_LEV_4  0x00000400
  #define FLASH_OPTR_nRST_STOP  0x00001000	/* nRST_STOP */
  #define FLASH_OPTR_nRST_STDBY 0x00002000	/* nRST_STDBY */
  #define FLASH_OPTR_nRST_SHDW  0x00004000	/* nRST_SHDW */
  #define FLASH_OPTR_IWDG_SW    0x00010000	/* IWDG_SW */
  #define FLASH_OPTR_IWDG_STOP  0x00020000	/* IWDG_STOP */
  #define FLASH_OPTR_IWDG_STDBY 0x00040000	/* IWDG_STDBY */
  #define FLASH_OPTR_WWDG_SW    0x00080000
  #define FLASH_OPTR_BFB2       0x00100000
  #define FLASH_OPTR_DUALBANK   0x00200000
  #define FLASH_OPTR_nBOOT1     0x00800000
  #define FLASH_OPTR_SRAM2_PE   0x01000000
  #define FLASH_OPTR_SRAM2_RST  0x02000000
#define TOFF_FLASH_PCROP1SR 0x0024		/* (RW) FLASH bank1 PCROP start address register */
  #define FLASH_PCROP1SR_PCROP1 0x0000FFFF
#define TOFF_FLASH_PCROP1ER 0x0028		/* (RW) FLASH bank1 PCROP end address register */
  #define FLASH_PCROP1ER_PCROP1_END 0x0000FFFF
  #define FLASH_PCROP1ER_PCROP_RDP  0x80000000
#define TOFF_FLASH_WRP1AR   0x002C		/* (RW) FLASH bank1 WRP area A address register */
  #define FLASH_WRP1AR_WRP1A_STRT   0x000000FF
  #define FLASH_WRP1AR_WRP1A_END    0x00FF0000
#define TOFF_FLASH_WRP1BR   0x0030		/* (RW) FLASH bank1 WRP area B address register */
  #define FLASH_WRP1BR_WRP1B_STRT   0x000000FF
  #define FLASH_WRP1BR_WRP1B_END    0x00FF0000
#define TOFF_FLASH_PCROP2SR 0x0044		/* (RW) FLASH bank2 PCROP start address register */
  #define FLASH_PCROP2SR_PCROP2_STRT 0x0000FFFF
#define TOFF_FLASH_PCROP2ER 0x0048		/* (RW) FLASH bank2 PCROP end address register */
  #define FLASH_PCROP2ER_PCROP2_END 0x0000FFFF
#define TOFF_FLASH_WRP2AR   0x004C		/* (RW) FLASH bank2 WRP area A address register */
  #define FLASH_WRP2AR_WRP2A_STRT   0x000000FF
  #define FLASH_WRP2AR_WRP2A_END    0x00FF0000
#define TOFF_FLASH_WRP2BR   0x0050		/* (RW) FLASH bank2 WRP area B address register */
  #define FLASH_WRP2BR_WRP2B_STRT   0x000000FF
  #define FLASH_WRP2BR_WRP2B_END    0x00FF0000

/*
 *  CRC CALCULATION UNIT
 */
#define TADR_CRC_BASE       (AHB1PERIPH_BASE + 0x3000)
#define TOFF_CRC_DR         0x0000		/* (RW) CRC Data register */
#define TOFF_CRC_IDR        0x0004		/* (RW-8) CRC Independent data register */
#define TOFF_CRC_CR         0x0008		/* (RW) CRC Control register */
#define TOFF_CRC_INIT       0x0010		/* (RW) Initial CRC value register */
#define TOFF_CRC_POL        0x0014		/* (RW) CRC polynomial register */


