imagou/QiitaSource/toppers/stm32l4xx/asp/arch/arm_m_gcc/stm32l4xx/_renamed_stm32l4xx.h
/*
 *  FLEXIBLE STATIC MEMORY
 */
#define TADR_FMC_R_BASE    (FMC_R_BASE + 0x0000)

/*
 *  FLEXIBLE MEMORY CONTROLLER
 */
#define TOFF_FMC_R_BTCR0    0x0000		/* (RW) NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR) 0 */
#define TOFF_FMC_R_BTCR1    0x0004		/* (RW) NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR) 1 */
#define TOFF_FMC_R_BTCR2    0x0008		/* (RW) NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR) 2 */
#define TOFF_FMC_R_BTCR3    0x000C		/* (RW) NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR) 3 */
#define TOFF_FMC_R_BTCR4    0x0010		/* (RW) NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR) 4 */
#define TOFF_FMC_R_BTCR5    0x0014		/* (RW) NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR) 5 */
#define TOFF_FMC_R_BTCR6    0x0018		/* (RW) NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR) 6 */
#define TOFF_FMC_R_BTCR7    0x001C		/* (RW) NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR) 7 */

/*
 *  FLEXIBLE MEMORY CONTROLLER BANK1E
 */
#define TOFF_FMC_R_BWTR0    0x0104		/* (RW) NOR/PSRAM write timing registers 0 */
#define TOFF_FMC_R_BWTR1    0x0108		/* (RW) NOR/PSRAM write timing registers 1 */
#define TOFF_FMC_R_BWTR2    0x010C		/* (RW) NOR/PSRAM write timing registers 2 */
#define TOFF_FMC_R_BWTR3    0x0110		/* (RW) NOR/PSRAM write timing registers 3 */
#define TOFF_FMC_R_BWTR4    0x0114		/* (RW) NOR/PSRAM write timing registers 4 */
#define TOFF_FMC_R_BWTR5    0x0118		/* (RW) NOR/PSRAM write timing registers 5 */
#define TOFF_FMC_R_BWTR6    0x011C		/* (RW) NOR/PSRAM write timing registers 6 */

/*
 *  FLEXIBLE MEMORY CONTROLLER BANK3
 */
#define TOFF_FMC_R_PCR      0x0080		/* (RW) NAND Flash control register */
#define TOFF_FMC_R_SR       0x0084		/* (RW) NAND Flash FIFO status and interrupt register */
#define TOFF_FMC_R_PMEM     0x0088		/* (RW) NAND Flash Common memory space timing register */
#define TOFF_FMC_R_PATT     0x008C		/* (RW) NAND Flash Attribute memory space timing register */
#define TOFF_FMC_R_ECCR     0x0090		/* (RW) NAND Flash ECC result registers */


#if !defined(TOPPERS_STM32L476_DISCOVERY) && !defined(TOPPERS_STM32L476_NUCLEO64)
/*
 *  DCMI
 */
#define TADR_DCMI_BASE      (AHB2PERIPH_BASE + 0x08050000)
#define TOFF_DCMI_CR        0x0000		/* (RW) DCMI control register */
  #define DCMI_CR_CAPTURE    0x00000001	/* DCMI Capture enable */
  #define DCMI_CR_CM         0x00000002	/* DCMI Capture mode */
  #define DCMI_CR_CROP       0x00000004	/* DCMI Crop feature */
  #define DCMI_CR_JPEG       0x00000008	/* DCMI JPEG format */
  #define DCMI_CR_ESS        0x00000010	/* DCMI Embedded synchronization select */
  #define DCMI_CR_PCKPOL     0x00000020	/* DCMI Pixel clock polarity */
  #define DCMI_CR_HSPOL      0x00000040	/* DCMI Horizontal synchronization polarity */
  #define DCMI_CR_VSPOL      0x00000080	/* DCMI Vertical synchronization polarity */
  #define DCMI_CR_FCRC       0x00000300	/* DCMI Frame capture rate control FCRC[1:0] */
  #define DCMI_CR_FCRC_0     0x00000100
  #define DCMI_CR_FCRC_1     0x00000200
  #define DCMI_CR_EDM        0x00000C00	/* DCMI Extended data mode EDM[1:0] */
  #define DCMI_CR_EDM_0      0x00000400
  #define DCMI_CR_EDM_1      0x00000800
  #define DCMI_CR_ENABLE     0x00004000	/* DCMI DCMI enable */
  #define DCMI_CR_BSM        0x00030000	/* DCMI Byte Select mode BSM[1:0] */
  #define DCMI_CR_BSM_0      0x00010000
  #define DCMI_CR_BSM_1      0x00020000
  #define DCMI_CR_OEBS       0x00040000	/* DCMI Odd/Even Byte Select (Byte Select Start) */
  #define DCMI_CR_LSM        0x00080000	/* DCMI Line Select mode */
  #define DCMI_CR_OELS       0x00100000	/* DCMI Odd/Even Line Select (Line Select Start) */
#define TOFF_DCMI_SR        0x0004		/* (RW) DCMI status register */
  #define DCMI_SR_HSYNC      0x00000001
  #define DCMI_SR_VSYNC      0x00000002
  #define DCMI_SR_FNE        0x00000004	/* DCMI FIFO not empty */
#define TOFF_DCMI_RISR      0x0008		/* (RW) DCMI raw interrupt status register */
  #define DCMI_RIS_FRAME_RIS 0x00000001	/* DCMI Capture complete raw interrupt status */
  #define DCMI_RIS_OVR_RIS   0x00000002	/* DCMI Overrun raw interrupt status */
  #define DCMI_RIS_ERR_RIS   0x00000004	/* DCMI Synchronization error raw interrupt status */
  #define DCMI_RIS_VSYNC_RIS 0x00000008	/* DCMI VSYNC raw interrupt status */
  #define DCMI_RIS_LINE_RIS  0x00000010	/* DCMI Line raw interrupt status */
#define TOFF_DCMI_IER       0x000C		/* (RW) DCMI interrupt enable register */
  #define DCMI_IER_FRAME_IE  0x00000001	/* DCMI Capture complete interrupt enable */
  #define DCMI_IER_OVR_IE    0x00000002	/* DCMI Overrun interrupt enable */
  #define DCMI_IER_ERR_IE    0x00000004	/* DCMI Synchronization error interrupt enable */
  #define DCMI_IER_VSYNC_IE  0x00000008	/* DCMI VSYNC interrupt enable */
  #define DCMI_IER_LINE_IE   0x00000010	/* DCMI Line interrupt enable */
  #define DCMI_IER_INT_IE    0x0000001F
#define TOFF_DCMI_MISR      0x0010		/* (RW) DCMI masked interrupt status register */
  #define DCMI_MIS_FRAME_MIS 0x00000001	/* DCMI Capture complete masked interrupt status */
  #define DCMI_MIS_OVR_MIS   0x00000002	/* DCMI Overrun masked interrupt status */
  #define DCMI_MIS_ERR_MIS   0x00000004	/* DCMI Synchronization error masked interrupt status */
  #define DCMI_MIS_VSYNC_MIS 0x00000008	/* DCMI VSYNC masked interrupt status */
  #define DCMI_MIS_LINE_MIS  0x00000010	/* DCMI Line masked interrupt status */
#define TOFF_DCMI_ICR       0x0014		/* (RW) DCMI interrupt clear register */
  #define DCMI_ICR_FRAME     0x00000001	/* DCMI Capture complete interrupt status clear */
  #define DCMI_ICR_OVR_ISC   0x00000002	/* DCMI Overrun interrupt status clear */
  #define DCMI_ICR_ERR_ISC   0x00000004	/* DCMI Synchronization error interrupt status clear */
  #define DCMI_ICR_VSYNC_ISC 0x00000008	/* DCMI Vertical synch interrupt status clear */
  #define DCMI_ICR_LINE_ISC  0x00000010	/* DCMI line interrupt status clear */
#define TOFF_DCMI_ESCR      0x0018		/* (RW) DCMI embedded synchronization code register */
  #define DCMI_ESCR_FSC      0x000000FF	/* DCMI Frame start delimiter code FSC[7:0] */
  #define DCMI_ESCR_FSC_0    0x00000001
  #define DCMI_ESCR_FSC_1    0x00000002
  #define DCMI_ESCR_FSC_2    0x00000004
  #define DCMI_ESCR_FSC_3    0x00000008
  #define DCMI_ESCR_FSC_4    0x00000010
  #define DCMI_ESCR_FSC_5    0x00000020
  #define DCMI_ESCR_FSC_6    0x00000040
  #define DCMI_ESCR_FSC_7    0x00000080
  #define DCMI_ESCR_LSC      0x0000FF00	/* DCMI Line start delimiter code LSC[7:0] */
  #define DCMI_ESCR_LSC_0    0x00000100
  #define DCMI_ESCR_LSC_1    0x00000200
  #define DCMI_ESCR_LSC_2    0x00000400
  #define DCMI_ESCR_LSC_3    0x00000800
  #define DCMI_ESCR_LSC_4    0x00001000
  #define DCMI_ESCR_LSC_5    0x00002000
  #define DCMI_ESCR_LSC_6    0x00004000
  #define DCMI_ESCR_LSC_7    0x00008000
  #define DCMI_ESCR_LEC      0x00FF0000	/* DCMI Line end delimiter code LEC[7:0] */
  #define DCMI_ESCR_LEC_0    0x00010000
  #define DCMI_ESCR_LEC_1    0x00020000
  #define DCMI_ESCR_LEC_2    0x00040000
  #define DCMI_ESCR_LEC_3    0x00080000
  #define DCMI_ESCR_LEC_4    0x00100000
  #define DCMI_ESCR_LEC_5    0x00200000
  #define DCMI_ESCR_LEC_6    0x00400000
  #define DCMI_ESCR_LEC_7    0x00800000
  #define DCMI_ESCR_FEC      0xFF000000	/* DCMI Frame end delimiter code FEC[7:0] */
  #define DCMI_ESCR_FEC_0    0x01000000
  #define DCMI_ESCR_FEC_1    0x02000000
  #define DCMI_ESCR_FEC_2    0x04000000
  #define DCMI_ESCR_FEC_3    0x08000000
  #define DCMI_ESCR_FEC_4    0x10000000
  #define DCMI_ESCR_FEC_5    0x20000000
  #define DCMI_ESCR_FEC_6    0x40000000
  #define DCMI_ESCR_FEC_7    0x80000000
#define TOFF_DCMI_ESUR      0x001C		/* (RW) DCMI embedded synchronization unmask register */
  #define DCMI_ESUR_FSU      0x000000FF	/* DCMI Frame start delimiter unmask FSU[7:0] */
  #define DCMI_ESUR_FSU_0    0x00000001
  #define DCMI_ESUR_FSU_1    0x00000002
  #define DCMI_ESUR_FSU_2    0x00000004
  #define DCMI_ESUR_FSU_3    0x00000008
  #define DCMI_ESUR_FSU_4    0x00000010
  #define DCMI_ESUR_FSU_5    0x00000020
  #define DCMI_ESUR_FSU_6    0x00000040
  #define DCMI_ESUR_FSU_7    0x00000080
  #define DCMI_ESUR_LSU      0x0000FF00	/* DCMI Line start delimiter unmask LSU[7:0] */
  #define DCMI_ESUR_LSU_0    0x00000100
  #define DCMI_ESUR_LSU_1    0x00000200
  #define DCMI_ESUR_LSU_2    0x00000400
  #define DCMI_ESUR_LSU_3    0x00000800
  #define DCMI_ESUR_LSU_4    0x00001000
  #define DCMI_ESUR_LSU_5    0x00002000
  #define DCMI_ESUR_LSU_6    0x00004000
  #define DCMI_ESUR_LSU_7    0x00008000
  #define DCMI_ESUR_LEU      0x00FF0000	/* DCMI Line end delimiter unmask LEU[7:0] */
  #define DCMI_ESUR_LEU_0    0x00010000
  #define DCMI_ESUR_LEU_1    0x00020000
  #define DCMI_ESUR_LEU_2    0x00040000
  #define DCMI_ESUR_LEU_3    0x00080000
  #define DCMI_ESUR_LEU_4    0x00100000
  #define DCMI_ESUR_LEU_5    0x00200000
  #define DCMI_ESUR_LEU_6    0x00400000
  #define DCMI_ESUR_LEU_7    0x00800000
  #define DCMI_ESUR_FEU      0xFF000000	/* DCMI Frame end delimiter unmask FEU[7:0] */
  #define DCMI_ESUR_FEU_0    0x01000000
  #define DCMI_ESUR_FEU_1    0x02000000
  #define DCMI_ESUR_FEU_2    0x04000000
  #define DCMI_ESUR_FEU_3    0x08000000
  #define DCMI_ESUR_FEU_4    0x10000000
  #define DCMI_ESUR_FEU_5    0x20000000
  #define DCMI_ESUR_FEU_6    0x40000000
  #define DCMI_ESUR_FEU_7    0x80000000
#define TOFF_DCMI_CWSTRTR   0x0020		/* (RW) DCMI crop window start */
  #define DCMI_CWSTRT_HOFFCNT   0x00003FFF	/* DCMI Horizontal offset count HOFFCNT[13:0] */
  #define DCMI_CWSTRT_HOFFCNT_0 0x00000001
  #define DCMI_CWSTRT_HOFFCNT_1 0x00000002
  #define DCMI_CWSTRT_HOFFCNT_2 0x00000004
  #define DCMI_CWSTRT_HOFFCNT_3 0x00000008
  #define DCMI_CWSTRT_HOFFCNT_4 0x00000010
  #define DCMI_CWSTRT_HOFFCNT_5 0x00000020
  #define DCMI_CWSTRT_HOFFCNT_6 0x00000040
  #define DCMI_CWSTRT_HOFFCNT_7 0x00000080
  #define DCMI_CWSTRT_HOFFCNT_8 0x00000100
  #define DCMI_CWSTRT_HOFFCNT_9 0x00000200
  #define DCMI_CWSTRT_HOFFCNT_10 0x00000400
  #define DCMI_CWSTRT_HOFFCNT_11 0x00000800
  #define DCMI_CWSTRT_HOFFCNT_12 0x00001000
  #define DCMI_CWSTRT_HOFFCNT_13 0x00002000
  #define DCMI_CWSTRT_VST   0x1FFF0000	/* DCMI Vertical start line count VST[12:0] */
  #define DCMI_CWSTRT_VST_0 0x00010000
  #define DCMI_CWSTRT_VST_1 0x00020000
  #define DCMI_CWSTRT_VST_2 0x00040000
  #define DCMI_CWSTRT_VST_3 0x00080000
  #define DCMI_CWSTRT_VST_4 0x00100000
  #define DCMI_CWSTRT_VST_5 0x00200000
  #define DCMI_CWSTRT_VST_6 0x00400000
  #define DCMI_CWSTRT_VST_7 0x00800000
  #define DCMI_CWSTRT_VST_8 0x01000000
  #define DCMI_CWSTRT_VST_9 0x02000000
  #define DCMI_CWSTRT_VST_10 0x04000000
  #define DCMI_CWSTRT_VST_11 0x08000000
  #define DCMI_CWSTRT_VST_12 0x10000000
#define TOFF_DCMI_CWSIZER   0x0024		/* (RW) DCMI crop window size */
  #define DCMI_CWSIZE_CAPCNT    0x00003FFF	/* DCMI Capture count CAPCNT[13:0] */
  #define DCMI_CWSIZE_CAPCNT_0  0x00000001
  #define DCMI_CWSIZE_CAPCNT_1  0x00000002
  #define DCMI_CWSIZE_CAPCNT_2  0x00000004
  #define DCMI_CWSIZE_CAPCNT_3  0x00000008
  #define DCMI_CWSIZE_CAPCNT_4  0x00000010
  #define DCMI_CWSIZE_CAPCNT_5  0x00000020
  #define DCMI_CWSIZE_CAPCNT_6  0x00000040
  #define DCMI_CWSIZE_CAPCNT_7  0x00000080
  #define DCMI_CWSIZE_CAPCNT_8  0x00000100
  #define DCMI_CWSIZE_CAPCNT_9  0x00000200
  #define DCMI_CWSIZE_CAPCNT_10 0x00000400
  #define DCMI_CWSIZE_CAPCNT_11 0x00000800
  #define DCMI_CWSIZE_CAPCNT_12 0x00001000
  #define DCMI_CWSIZE_CAPCNT_13 0x00002000
  #define DCMI_CWSIZE_VLINE  0x3FFF0000	/* DCMI Vertical line count VLINE[13:0] */
  #define DCMI_CWSIZE_VLINE_0   0x00010000
  #define DCMI_CWSIZE_VLINE_1   0x00020000
  #define DCMI_CWSIZE_VLINE_2   0x00040000
  #define DCMI_CWSIZE_VLINE_3   0x00080000
  #define DCMI_CWSIZE_VLINE_4   0x00100000
  #define DCMI_CWSIZE_VLINE_5   0x00200000
  #define DCMI_CWSIZE_VLINE_6   0x00400000
  #define DCMI_CWSIZE_VLINE_7   0x00800000
  #define DCMI_CWSIZE_VLINE_8   0x01000000
  #define DCMI_CWSIZE_VLINE_9   0x02000000
  #define DCMI_CWSIZE_VLINE_10  0x04000000
  #define DCMI_CWSIZE_VLINE_11  0x08000000
  #define DCMI_CWSIZE_VLINE_12  0x10000000
  #define DCMI_CWSIZE_VLINE_13  0x20000000
#define TOFF_DCMI_DR        0x0028		/* (RW) DCMI data register */
  #define DCMI_DR_BYTE0      0x000000FF	/* DCMI Data byte 0 Byte0[7:0] */
  #define DCMI_DR_BYTE0_0    0x00000001
  #define DCMI_DR_BYTE0_1    0x00000002
  #define DCMI_DR_BYTE0_2    0x00000004
  #define DCMI_DR_BYTE0_3    0x00000008
  #define DCMI_DR_BYTE0_4    0x00000010
  #define DCMI_DR_BYTE0_5    0x00000020
  #define DCMI_DR_BYTE0_6    0x00000040
  #define DCMI_DR_BYTE0_7    0x00000080
  #define DCMI_DR_BYTE1      0x0000FF00	/* DCMI Data byte 1 Byte1[7:0] */
  #define DCMI_DR_BYTE1_0    0x00000100
  #define DCMI_DR_BYTE1_1    0x00000200
  #define DCMI_DR_BYTE1_2    0x00000400
  #define DCMI_DR_BYTE1_3    0x00000800
  #define DCMI_DR_BYTE1_4    0x00001000
  #define DCMI_DR_BYTE1_5    0x00002000
  #define DCMI_DR_BYTE1_6    0x00004000
  #define DCMI_DR_BYTE1_7    0x00008000
  #define DCMI_DR_BYTE2      0x00FF0000	/* DCMI Data byte 2 Byte2[7:0] */
  #define DCMI_DR_BYTE2_0    0x00010000
  #define DCMI_DR_BYTE2_1    0x00020000
  #define DCMI_DR_BYTE2_2    0x00040000
  #define DCMI_DR_BYTE2_3    0x00080000
  #define DCMI_DR_BYTE2_4    0x00100000
  #define DCMI_DR_BYTE2_5    0x00200000
  #define DCMI_DR_BYTE2_6    0x00400000
  #define DCMI_DR_BYTE2_7    0x00800000
  #define DCMI_DR_BYTE3      0xFF000000	/* DCMI Data byte 3 Byte3[7:0] */
  #define DCMI_DR_BYTE3_0    0x01000000
  #define DCMI_DR_BYTE3_1    0x02000000
  #define DCMI_DR_BYTE3_2    0x04000000
  #define DCMI_DR_BYTE3_3    0x08000000
  #define DCMI_DR_BYTE3_4    0x10000000
  #define DCMI_DR_BYTE3_5    0x20000000
  #define DCMI_DR_BYTE3_6    0x40000000
  #define DCMI_DR_BYTE3_7    0x80000000


