imagou/QiitaSource/toppers/stm32l4xx/asp/arch/arm_m_gcc/stm32l4xx/_renamed_stm32l4xx.h
/*
 *  OCTO SERIAL PERIPHERAL INTERFACE
 */
#define TADR_OCTOSPI1_BASE  (OCTOSPI1_R_BASE)
#define TADR_OCTOSPI2_BASE  (OCTOSPI2_R_BASE)
#define TADR_OCTOSPIM_BASE  (AHB2PERIPH_BASE + 0x08061C00)
#define TOFF_OCTOSPI_CR     0x0000		/* (RW) OCTOSPI Control register */
  #define OCTOSPI_CR_EN      0x00000001	/* Enable */
  #define OCTOSPI_CR_ABORT   0x00000002	/* Abort request */
  #define OCTOSPI_CR_DMAEN   0x00000004	/* DMA Enable */
  #define OCTOSPI_CR_TCEN    0x00000008	/* Timeout Counter Enable */
  #define OCTOSPI_CR_DQM     0x00000040	/* Dual-Quad Mode */
  #define OCTOSPI_CR_FSEL    0x00000080	/* Flash Select */
  #define OCTOSPI_CR_FTHRES  0x00001F00	/* FIFO Threshold Level */
  #define OCTOSPI_CR_TEIE    0x00010000	/* Transfer Error Interrupt Enable */
  #define OCTOSPI_CR_TCIE    0x00020000	/* Transfer Complete Interrupt Enable */
  #define OCTOSPI_CR_FTIE    0x00040000	/* FIFO Threshold Interrupt Enable */
  #define OCTOSPI_CR_SMIE    0x00080000	/* Status Match Interrupt Enable */
  #define OCTOSPI_CR_TOIE    0x00100000	/* TimeOut Interrupt Enable */
  #define OCTOSPI_CR_APMS    0x00400000	/* Automatic Poll Mode Stop */
  #define OCTOSPI_CR_PMM     0x00800000	/* Polling Match Mode */
  #define OCTOSPI_CR_FMODE   0x30000000	/* Functional Mode */
  #define OCTOSPI_CR_FMODE_0 0x10000000
  #define OCTOSPI_CR_FMODE_1 0x20000000
#define TOFF_OCTOSPI_DCR1   0x0004		/* (RW) OCTOSPI Device Configuration register 1 */
  #define OCTOSPI_DCR1_CKMODE  0x00000001	/* Mode 0 / Mode 3 */
  #define OCTOSPI_DCR1_FRCK    0x00000002	/* Free Running Clock */
  #define OCTOSPI_DCR1_CSHT    0x00000700	/* Chip Select High Time */
  #define OCTOSPI_DCR1_DEVSIZE 0x001F0000	/* Device Size */
  #define OCTOSPI_DCR1_MTYPs   0x07000000	/* Memory Type */
  #define OCTOSPI_DCR1_MTYP_0  0x01000000
  #define OCTOSPI_DCR1_MTYP_1  0x02000000
  #define OCTOSPI_DCR1_MTYP_2  0x04000000
#define TOFF_OCTOSPI_DCR2   0x000C		/* (RW) OCTOSPI Device Configuration register 2 */
  #define OCTOSPI_DCR2_PRESCALER  0x000000FF	/* Clock prescaler */
  #define OCTOSPI_DCR2_WRAPSIZE   0x00070000	/* Wrap Size */
  #define OCTOSPI_DCR2_WRAPSIZE_0 0x00010000
  #define OCTOSPI_DCR2_WRAPSIZE_1 0x00020000
  #define OCTOSPI_DCR2_WRAPSIZE_2 0x00040000
#define TOFF_OCTOSPI_DCR3   0x0010		/* (RW) OCTOSPI Device Configuration register 3 */
  #define OCTOSPI_DCR3_CSBOUND 0x001F0000	/* CS Boundary */
#define TOFF_OCTOSPI_SR     0x0020		/* (RW) OCTOSPI Status register */
  #define OCTOSPI_SR_TEF     0x00000001	/* Transfer Error Flag */
  #define OCTOSPI_SR_TCF     0x00000002	/* Transfer Complete Flag */
  #define OCTOSPI_SR_FTF     0x00000004	/* FIFO Threshold Flag */
  #define OCTOSPI_SR_SMF     0x00000008	/* Status Match Flag */
  #define OCTOSPI_SR_TOF     0x00000010	/* Timeout Flag */
  #define OCTOSPI_SR_BUSY    0x00000020	/* Busy */
  #define OCTOSPI_SR_FLEVEL  0x00003F00	/* FIFO Level */
#define TOFF_OCTOSPI_FCR    0x0024		/* (RW) OCTOSPI Flag Clear register */
  #define OCTOSPI_FCR_CTEF   0x00000001	/* Clear Transfer Error Flag */
  #define OCTOSPI_FCR_CTCF   0x00000002	/* Clear Transfer Complete Flag */
  #define OCTOSPI_FCR_CSMF   0x00000008	/* Clear Status Match Flag */
  #define OCTOSPI_FCR_TOF    0x00000100	/* Clear Timeout Flag */
#define TOFF_OCTOSPI_DLR    0x0040		/* (RW) OCTOSPI Data Length register */
#define TOFF_OCTOSPI_AR     0x0048		/* (RW) OCTOSPI Address register */
#define TOFF_OCTOSPI_DR     0x0050		/* (RW) OCTOPSI Data register */
#define TOFF_OCTOSPI_PSMKR  0x0080		/* (RW) OCTOSPI Polling Status Mask register */
#define TOFF_OCTOSPI_PSMAR  0x0084		/* (RW) OCTOSPI Polling Status Match register */
#define TOFF_OCTOSPI_PIR    0x0090		/* (RW) OCTOSPI Polling Interval register */
#define TOFF_OCTOSPI_CCR    0x0100		/* (RW) OCTOSPI Communication Configuration register */
  #define OCTOSPI_CCR_IMODE  0x00000007	/* Instruction Mode */
  #define OCTOSPI_CCR_IMODE_0  0x00000001
  #define OCTOSPI_CCR_IMODE_1  0x00000002
  #define OCTOSPI_CCR_IMODE_2  0x00000004
  #define OCTOSPI_CCR_IDTR   0x00000008	/* Instruction Double Transfer Rate */
  #define OCTOSPI_CCR_ISIZE  0x00000030	/* Instruction Size */
  #define OCTOSPI_CCR_ISIZE_0  0x00000010
  #define OCTOSPI_CCR_ISIZE_1  0x00000020
  #define OCTOSPI_CCR_ADMODE 0x00000700	/* Address Mode */
  #define OCTOSPI_CCR_ADMODE_0 0x00000100
  #define OCTOSPI_CCR_ADMODE_1 0x00000200
  #define OCTOSPI_CCR_ADMODE_2 0x00000400
  #define OCTOSPI_CCR_ADDTR  0x00000800	/* Address Double Transfer Rate */
  #define OCTOSPI_CCR_ADSIZE 0x00003000	/* Address Size */
  #define OCTOSPI_CCR_ADSIZE_0 0x00001000
  #define OCTOSPI_CCR_ADSIZE_1 0x00002000
  #define OCTOSPI_CCR_ABMODE 0x00070000	/* Alternate Bytes Mode */
  #define OCTOSPI_CCR_ABMODE_0 0x00010000
  #define OCTOSPI_CCR_ABMODE_1 0x00020000
  #define OCTOSPI_CCR_ABMODE_2 0x00040000
  #define OCTOSPI_CCR_ABDTR  0x00080000	/* Alternate Bytes Double Transfer Rate */
  #define OCTOSPI_CCR_ABSIZE 0x00300000	/* Alternate Bytes Size */
  #define OCTOSPI_CCR_ABSIZE_0 0x00100000
  #define OCTOSPI_CCR_ABSIZE_1 0x00200000
  #define OCTOSPI_CCR_DMODE  0x07000000	/* Data Mode */
  #define OCTOSPI_CCR_DMODE_0  0x01000000
  #define OCTOSPI_CCR_DMODE_1  0x02000000
  #define OCTOSPI_CCR_DMODE_2  0x04000000
  #define OCTOSPI_CCR_DDTR   0x08000000	/* Data Double Transfer Rate */
  #define OCTOSPI_CCR_DQSE   0x20000000	/* DQS Enable */
  #define OCTOSPI_CCR_SIOO   0x80000000	/* Send Instruction Only Once Mode */
#define TOFF_OCTOSPI_TCR    0x0108		/* (RW) OCTOSPI Timing Configuration register */
  #define OCTOSPI_TCR_DCYC   0x0000001F	/* Number of Dummy Cycles */
  #define OCTOSPI_TCR_DHQC   0x10000000	/* Delay Hold Quarter Cycle */
  #define OCTOSPI_TCR_SSHIFT 0x40000000	/* Sample Shift */
#define TOFF_OCTOSPI_IR     0x0110		/* (RW) OCTOSPI Instruction register */
#define TOFF_OCTOSPI_ABR    0x0120		/* (RW) OCTOSPI Alternate Bytes register */
#define TOFF_OCTOSPI_LPTR   0x0130		/* (RW) OCTOSPI Low Power Timeout register */
#define TOFF_OCTOSPI_WCCR   0x0180		/* (RW) OCTOSPI Write Communication Configuration register */
  #define OCTOSPI_WCCR_IMODE 0x00000007	/* Instruction Mode */
  #define OCTOSPI_WCCR_IMODE_0  0x00000001
  #define OCTOSPI_WCCR_IMODE_1  0x00000002
  #define OCTOSPI_WCCR_IMODE_2  0x00000004
  #define OCTOSPI_WCCR_IDTR  0x00000008	/* Instruction Double Transfer Rate */
  #define OCTOSPI_WCCR_ISIZE 0x00000030	/* Instruction Size */
  #define OCTOSPI_WCCR_ISIZE_0  0x00000010
  #define OCTOSPI_WCCR_ISIZE_1  0x00000020
  #define OCTOSPI_WCCR_ADMODE 0x00000700	/* Address Mode */
  #define OCTOSPI_WCCR_ADMODE_0 0x00000100
  #define OCTOSPI_WCCR_ADMODE_1 0x00000200
  #define OCTOSPI_WCCR_ADMODE_2 0x00000400
  #define OCTOSPI_WCCR_ADDTR 0x00000800	/* Address Double Transfer Rate */
  #define OCTOSPI_WCCR_ADSIZE 0x00003000	/* Address Size */
  #define OCTOSPI_WCCR_ADSIZE_0 0x00001000
  #define OCTOSPI_WCCR_ADSIZE_1 0x00002000
  #define OCTOSPI_WCCR_ABMODE 0x00070000	/* Alternate Bytes Mode */
  #define OCTOSPI_WCCR_ABMODE_0 0x00010000
  #define OCTOSPI_WCCR_ABMODE_1 0x00020000
  #define OCTOSPI_WCCR_ABMODE_2 0x00040000
  #define OCTOSPI_WCCR_ABDTR 0x00080000	/* Alternate Bytes Double Transfer Rate */
  #define OCTOSPI_WCCR_ABSIZE 0x00300000	/* Alternate Bytes Size */
  #define OCTOSPI_WCCR_ABSIZE_0 0x00100000
  #define OCTOSPI_WCCR_ABSIZE_1 0x00200000
  #define OCTOSPI_WCCR_DMODE 0x07000000	/* Data Mode */
  #define OCTOSPI_WCCR_DMODE_0  0x01000000
  #define OCTOSPI_WCCR_DMODE_1  0x02000000
  #define OCTOSPI_WCCR_DMODE_2  0x04000000
  #define OCTOSPI_WCCR_DDTR  0x08000000	/* Data Double Transfer Rate */
  #define OCTOSPI_WCCR_DQSE  0x20000000	/* DQS Enable */
  #define OCTOSPI_WCCR_SIOO  0x80000000	/* Send Instruction Only Once Mode */
#define TOFF_OCTOSPI_WTCR   0x0188		/* (RW) OCTOSPI Write Timing Configuration register */
  #define OCTOSPI_WTCR_DCYC  0x0000001F	/* Number of Dummy Cycles */
#define TOFF_OCTOSPI_WIR    0x0190		/* (RW) OCTOSPI Write Instruction register */
#define TOFF_OCTOSPI_WABR   0x01A0		/* (RW) OCTOSPI Write Alternate Bytes register */
#define TOFF_OCTOSPI_HLCR   0x0200		/* (RW) OCTOSPI Hyperbus Latency Configuration register */
  #define OCTOSPI_HLCR_LM    0x00000001	/* Latency Mode */
  #define OCTOSPI_HLCR_WZL   0x00000002	/* Write Zero Latency */
  #define OCTOSPI_HLCR_TACC  0x0000FF00	/* Access Time */
  #define OCTOSPI_HLCR_TRWR  0x00FF0000	/* Read Write Recovery Time */


#define TOFF_OCTOSPIM_PCR1  0x0004		/* (RW) OCTOSPI IO Manager Port[1] Configuration register */
  #define OCTOSPIM_PCR_CLKEN  0x00000001	/* CLK/CLKn Enable for Port n */
  #define OCTOSPIM_PCR_CLKSRC 0x00000002	/* CLK/CLKn Source for Port n */
  #define OCTOSPIM_PCR_DQSEN  0x00000010	/* DQS Enable for Port n */
  #define OCTOSPIM_PCR_DQSSRC 0x00000020	/* DQS Source for Port n */
  #define OCTOSPIM_PCR_NCSEN  0x00000100	/* nCS Enable for Port n */
  #define OCTOSPIM_PCR_NCSSRC 0x00000200	/* nCS Source for Port n */
  #define OCTOSPIM_PCR_IOLEN  0x00010000	/* IO[3:0] Enable for Port n */
  #define OCTOSPIM_PCR_IOLSRC 0x00060000	/* IO[3:0] Source for Port n */
  #define OCTOSPIM_PCR_IOLSRC_0  0x00020000
  #define OCTOSPIM_PCR_IOLSRC_1  0x00040000
  #define OCTOSPIM_PCR_IOHEN  0x01000000	/* IO[7:4] Enable for Port n */
  #define OCTOSPIM_PCR_IOHSRC 0x06000000	/* IO[7:4] Source for Port n */
  #define OCTOSPIM_PCR_IOHSRC_0  0x02000000
  #define OCTOSPIM_PCR_IOHSRC_1  0x04000000
#define TOFF_OCTOSPIM_PCR2  0x0008		/* (RW) OCTOSPI IO Manager Port[2] Configuration register */
#else
/*
 * QUAD SERIAL PERIPHERAL INTERFACE
 */
#define TADR_QSPI_R_BASE    (QSPI_R_BASE)
#define TOFF_QUADSPI_CR     0x0000		/* (RW) QUADSPI Control register */
  #define QUADSPI_CR_EN         0x00000001	/* Enable */
  #define QUADSPI_CR_ABORT      0x00000002	/* Abort request */
  #define QUADSPI_CR_DMAEN      0x00000004	/* DMA Enable */
  #define QUADSPI_CR_TCEN       0x00000008	/* Timeout Counter Enable */
  #define QUADSPI_CR_SSHIFT     0x00000010	/* Sample Shift */
  #define QUADSPI_CR_FTHRES     0x00000F00	/* FTHRES[3:0] FIFO Level */
  #define QUADSPI_CR_TEIE       0x00010000	/* Transfer Error Interrupt Enable */
  #define QUADSPI_CR_TCIE       0x00020000	/* Transfer Complete Interrupt Enable */
  #define QUADSPI_CR_FTIE       0x00040000	/* FIFO Threshold Interrupt Enable */
  #define QUADSPI_CR_SMIE       0x00080000	/* Status Match Interrupt Enable */
  #define QUADSPI_CR_TOIE       0x00100000	/* TimeOut Interrupt Enable */
  #define QUADSPI_CR_APMS       0x00400000	/* Automatic Polling Mode Stop */
  #define QUADSPI_CR_PMM        0x00800000	/* Polling Match Mode */
  #define QUADSPI_CR_PRESCALER  0xFF000000	/* PRESCALER[7:0] Clock prescaler */
#define TOFF_QUADSPI_DCR    0x0004		/* (RW) QUADSPI Device Configuration register */
  #define QUADSPI_DCR_CKMODE    0x00000001	/* Mode 0 / Mode 3 */
  #define QUADSPI_DCR_CSHT      0x00000700	/* CSHT[2:0]: ChipSelect High Time */
  #define QUADSPI_DCR_CSHT_0    0x00000100
  #define QUADSPI_DCR_CSHT_1    0x00000200
  #define QUADSPI_DCR_CSHT_2    0x00000400
  #define QUADSPI_DCR_FSIZE     0x001F0000	/* FSIZE[4:0]: Flash Size */
#define TOFF_QUADSPI_SR     0x0008		/* (RW) QUADSPI Status register */
  #define QUADSPI_SR_TEF        0x00000001	/* Transfer Error Flag */
  #define QUADSPI_SR_TCF        0x00000002	/* Transfer Complete Flag */
  #define QUADSPI_SR_FTF        0x00000004	/* FIFO Threshlod Flag */
  #define QUADSPI_SR_SMF        0x00000008	/* Status Match Flag */
  #define QUADSPI_SR_TOF        0x00000010	/* Timeout Flag */
  #define QUADSPI_SR_BUSY       0x00000020	/* Busy */
  #define QUADSPI_SR_FLEVEL     0x00001F00	/* FIFO Threshlod Flag */
#define TOFF_QUADSPI_FCR    0x000C		/* (W)  QUADSPI Flag Clear register */
  #define QUADSPI_FCR_CTEF      0x00000001	/* Clear Transfer Error Flag */
  #define QUADSPI_FCR_CTCF      0x00000002	/* Clear Transfer Complete Flag */
  #define QUADSPI_FCR_CSMF      0x00000008	/* Clear Status Match Flag */
  #define QUADSPI_FCR_CTOF      0x00000010	/* Clear Timeout Flag */
#define TOFF_QUADSPI_DLR    0x0010		/* (RW) QUADSPI Data Length register */
#define TOFF_QUADSPI_CCR    0x0014		/* (RW) QUADSPI Communication Configuration register */
  #define QUADSPI_CCR_INSTRUCTION 0x000000FF	/* INSTRUCTION[7:0]: Instruction */
  #define QUADSPI_CCR_IMODE     0x00000300	/* IMODE[1:0]: Instruction Mode */
  #define QUADSPI_CCR_IMODE_0   0x00000100
  #define QUADSPI_CCR_IMODE_1   0x00000200
  #define QUADSPI_CCR_ADMODE    0x00000C00	/* ADMODE[1:0]: Address Mode */
  #define QUADSPI_CCR_ADMODE_0  0x00000400
  #define QUADSPI_CCR_ADMODE_1  0x00000800
  #define QUADSPI_CCR_ADSIZE    0x00003000	/* ADSIZE[1:0]: Address Size */
  #define QUADSPI_CCR_ADSIZE_0  0x00001000
  #define QUADSPI_CCR_ADSIZE_1  0x00002000
  #define QUADSPI_CCR_ABMODE    0x0000C000	/* ABMODE[1:0]: Alternate Bytes Mode */
  #define QUADSPI_CCR_ABMODE_0  0x00004000
  #define QUADSPI_CCR_ABMODE_1  0x00008000
  #define QUADSPI_CCR_ABSIZE    0x00030000	/* ABSIZE[1:0]: Instruction Mode */
  #define QUADSPI_CCR_ABSIZE_0  0x00010000
  #define QUADSPI_CCR_ABSIZE_1  0x00020000
  #define QUADSPI_CCR_DCYC      0x007C0000	/* DCYC[4:0]: Dummy Cycles */
  #define QUADSPI_CCR_DMODE     0x03000000	/* DMODE[1:0]: Data Mode */
  #define QUADSPI_CCR_DMODE_0   0x01000000
  #define QUADSPI_CCR_DMODE_1   0x02000000
  #define QUADSPI_CCR_FMODE     0x0C000000	/* FMODE[1:0]: Functional Mode */
  #define QUADSPI_CCR_FMODE_0   0x04000000
  #define QUADSPI_CCR_FMODE_1   0x08000000
  #define QUADSPI_CCR_SIOO      0x10000000	/* SIOO: Send Instruction Only Once Mode */
  #define QUADSPI_CCR_DDRM      0x80000000	/* DDRM: Double Data Rate Mode */
#define TOFF_QUADSPI_AR     0x0018		/* (RW) QUADSPI Address register */
#define TOFF_QUADSPI_ABR    0x001C		/* (RW) QUADSPI Alternate Bytes register */
#define TOFF_QUADSPI_DR     0x0020		/* (RW) QUADSPI Data register */
#define TOFF_QUADSPI_PSMKR  0x0024		/* (RW) QUADSPI Polling Status Mask register */
#define TOFF_QUADSPI_PSMAR  0x0028		/* (RW) QUADSPI Polling Status Match register */
#define TOFF_QUADSPI_PIR    0x002C		/* (RW) QUADSPI Polling Interval register */
  #define QUADSPI_PIR_INTERVAL  0x0000FFFF	/* INTERVAL[15:0]: Polling Interval */
#define TOFF_QUADSPI_LPTR   0x0030		/* (RW) QUADSPI Low Power Timeout register */
  #define QUADSPI_LPTR_TIMEOUT  0x0000FFFF	/* TIMEOUT[15:0]: Timeout period */
#endif


/*
 *  PCGCCTL BIT DEFINITIONS
 */
#define USB_OTG_PCGCCTL_STOPCLK     0x00000001	/* SETUP packet count */
#define USB_OTG_PCGCCTL_GATECLK     0x00000002	/* Bit 0 */
#define USB_OTG_PCGCCTL_PHYSUSP     0x00000010	/* Bit 1 */

/*
 *  DEBUG MCU
 */
#define TADR_DBGMCU_BASE    (DBGMCU_BASE)
#define TOFF_DBGMCU_IDCODE  0x0000		/* (RW) MCU device ID code */
#define TOFF_DBGMCU_CR      0x0004		/* (RW) Debug MCU configuration register */
#define TOFF_DBGMCU_APB1FZR1 0x0008		/* (RW) Debug MCU APB1 freeze register */
#define TOFF_DBGMCU_APB1FZR2 0x000C		/* (RW) Debug MCU APB1 freeze register 2 */
#define TOFF_DBGMCU_APB2FZ  0x000C		/* (RW) Debug MCU APB2 freeze register */


#endif  /* _STM32L4XX_H_ */

